Repository: flyinghead/flycast
Catalog: resources/i18n/*.po
Languages: fr, hu, ja, pt_br, sv

source: User %s authenticated
fr: Utilisateur %s authentifié
hu: A %s felhasználó hitelesítve
ja: ユーザー %s が認証されました
pt_br: Usuário %s autenticado
sv: Användare %s autentiserad

source: RetroAchievements authentication failed
fr: L'authentification de RetroAchievements a échoué
hu: Sikertelen RetroAchievements hitelesítés
ja: レトロアチーブメントの認証に失敗しました
pt_br: A autenticação de RetroConquistas falhou
sv: Autentisering för RetroAchievements misslyckades

source: No user token returned
fr: Pas de jeton utilisateur renvoyé
hu: Nincs visszaküldött felhasználói token
ja: ユーザートークンが返されていません
pt_br: Nenhum token de usuário retornou
sv: Ingen användartoken returnerades

source: RetroAchievements disconnected
fr: RetroAchievements déconnecté
hu: RetroAchievements leválasztva
ja: レトロアチーブメントが切断されました
pt_br: RetroConquistas desconectada
sv: RetroAchievements frånkopplad

source: RetroAchievements reconnected
fr: RetroAchievements reconnecté
hu: RetroAchievements újra csatlakozott
ja: レトロアチーブメントが再接続されました
pt_br: RetroConquistas reconectada
sv: RetroAchievements återansluten

source: Achievement %s unlocked!
fr: Succès %s débloqué !
hu: %s trófea feloldva!
ja: 実績 %s が解除されました！
pt_br: Conquista %s desbloqueada!
sv: Prestationen %s låstes upp!

source: Leaderboard %s started
fr: Podium %s démarré
hu: Ranglista %s elindult
ja: リーダーボード %s が開始しました
pt_br: Classificação %s começou
sv: Ledartavlan %s startad

source: Leaderboard %s failed
fr: Le podium %s a échoué
hu: A ranglista %s sikertelen
ja: リーダーボード %s が失敗しました
pt_br: Classificação %s falhou
sv: Ledartavlan %s misslyckades

source: Leaderboard %s submitted
fr: Podium %s envoyé
hu: Ranglista %s beküldve
ja: リーダーボード %s が提出されました
pt_br: Classificação %s enviada
sv: Ledartavlan %s inskickad

source: Mastered %s
fr: Maîtrise de %s
ja: マスター済み %s
pt_br: Dominado %s
sv: Bemästrade %s

source: Completed %s
fr: %s terminé
hu: Teljesítve: %s
ja: %sを完了しました
pt_br: Completado %s
sv: Färdigställde %s

source: %d achievements, %d points
fr: %d succès, %d points
hu: %d trófea, %d pont
ja: %d 実績、 %d ポイント
pt_br: %d conquistas, %d pontos
sv: %d prestationer, %d poäng

source: You have %d of %d achievements unlocked.
fr: Vous avez %d succès sur %d débloqués.
ja: %d / %d の実績が解除されています。
pt_br: Você tem %d de %d conquistas desbloqueadas.
sv: Du har %d av %d prestationer upplåsta.

source: This game has no achievements.
fr: Ce jeu n'a pas de succès.
hu: Ez a játék nem tartalmaz trófeákat.
ja: このゲームには実績がありません。
pt_br: Esse jogo não tem conquistas.
sv: Detta spel har inga prestationer.

source: Hardcore Mode
fr: Mode Hardcore
hu: Hardcore mód
ja: ハードコアモード
pt_br: Modo Hardcore
sv: Hardcore-läge

source: Hardcore mode disabled
fr: Mode hardcore désactivé
hu: Hardcore mód letiltva
ja: ハードコア モードは無効です
pt_br: Modo Hardcore desativado
sv: Hardcore-läget inaktiverat

source: Unrecognized media inserted
fr: Média inconnu inséré
hu: Ismeretlen adathordozó behelyezve
ja: 認識できないメディアが挿入されました
pt_br: Mídia desconhecida inserida
sv: Inmatat media känns inte igen

source: Media change failed
fr: Erreur de changement de média
hu: A média váltás sikertelen volt
ja: メディアの変更に失敗しました
pt_br: Mudança de mídia falhou
sv: Mediabyte misslyckades

source: WARNING: DreamLink disconnected from port %c
fr: Attention : DreamLink déconnecté du port %c
hu: FIGYELEM: A DreamLink leválasztódott a %c portról
ja: 警告: DreamLink がポート %c から切断されました
pt_br: AVISO: DreamLink desconectado da porta %c
sv: VARNING: DreamLink kopplade från port %c

source: DPad2 Up
fr: DPad2 Haut
hu: DPad2 fel
ja: DPad2 上
pt_br: Dpad2 Cima
sv: DPad2 upp

source: DPad2 Down
fr: DPad2 Bas
hu: DPad2 le
ja: DPad2 下
pt_br: Dpad2 Baixo
sv: DPad2 ner

source: DPad2 Left
fr: DPad2 Gauche
hu: DPad2 balra
ja: DPad2 左
pt_br: Dpad2 Esquerda
sv: DPad2 vänster

source: DPad2 Right
fr: DPad2 Droite
hu: DPad2 jobbra
ja: DPad2 右
pt_br: Dpad2 Direita
sv: DPad2 höger

source: VMU1 Up
hu: VMU1 fel
ja: VMU1 上
pt_br: VMU1 Cima
sv: VMU1 Upp

source: VMU1 Down
hu: VMU1 le
ja: VMU1 下
pt_br: VMU1 Baixo
sv: VMU1 Ner

source: VMU1 Left
hu: VMU1 balra
ja: VMU1 左
pt_br: VMU1 Esquerda
sv: VMU1 Vänster

source: VMU1 Right
hu: VMU1 jobbra
ja: VMU1 右
pt_br: VMU1 Direita
sv: VMU1 Höger

source: Inactive
hu: Inaktív
ja: 無効
pt_br: Inativo
sv: Inaktiv

source: Connected
fr: Connecté
hu: Csatlakoztatva
ja: 接続されました
pt_br: Conectado
sv: Ansluten

source: Disconnected
fr: Déconnecté
hu: Nincs csatlakoztatva
ja: 切断されました
pt_br: Desconectado
sv: Frånkopplad

source: Back
hu: Vissza
ja: 戻る
pt_br: Voltar
sv: Bakåt

source: Guide
hu: Útmutató
ja: ガイド
pt_br: Guia

source: Start
fr: Démarrer
ja: スタート
pt_br: Iniciar
sv: Starta

source: DPad Up
hu: DPad fel
ja: DPad 上
pt_br: Dpad Cima

source: DPad Down
hu: DPad le
ja: DPad 下
pt_br: Dpad Baixo

source: DPad Left
hu: DPad balra
ja: DPad 左
pt_br: Dpad Esquerda

source: DPad Right
hu: DPad jobbra
ja: DPad 右
pt_br: Dpad Direita

source: Misc
hu: Egyebek
ja: その他
pt_br: Diversos
sv: Diverse

source: Paddle 1
ja: パドル 1
sv: Paddel 1

source: Paddle 2
ja: パドル 2
pt_br: Pandale 2
sv: Paddel 2

source: Paddle 3
ja: パドル 3
sv: Paddel 3

source: Paddle 4
ja: パドル 4
sv: Paddel 4

source: Touchpad
hu: Érintőpad
ja: タッチパッド
sv: Pekplatta

source: Left Stick X
hu: Bal joystick X
ja: 左スティック X
pt_br: Analógico Esquerdo X
sv: Vänsterspak X

source: Left Stick Y
hu: Bal joystick Y
ja: 左スティック Y
pt_br: Analógico Esquerdo Y
sv: Vänsterspak Y

source: Right Stick X
hu: Jobb joystick X
ja: 右スティック X
pt_br: Analógico direito X
sv: Högerspak X

source: Right Stick Y
hu: Jobb joystick Y
ja: 右スティック Y
pt_br: Analógico direito Y
sv: Högerspak Y

source: Default Mouse
hu: Alapértelmezett egér
ja: デフォルトマウス
pt_br: Mouse padrão
sv: Standardmus

source: Mouse %d
hu: Egér %d
ja: マウス %d
sv: Mus %d

source: Flycast Error
fr: Erreur Flycast
hu: Flycast hiba
ja: Flycastエラー
pt_br: Erro no Flycast
sv: Fel i Flycast

source: No Audio
fr: Pas de son
hu: Nincs hang
ja: オーディオなし
pt_br: Sem áudio
sv: Inget ljud

source: Automatic AAudio / OpenSL selection
fr: Sélection AAudio / OpenSL automatique
ja: AAudio / OpenSL の自動選択
pt_br: Seleção automática de AAudio / OpenSL
sv: Automatiskt val av AAudio / OpenSL

source: Can't find Pictures library
fr: Impossible de trouver la librairie Images
hu: Nem találom a Képek könyvtárat
ja: 画像ライブラリが見つかりません
pt_br: Não foi possível localizar a pasta Imagens
sv: Kan inte hitta bildbiblioteket

source: Can't read directory %s
fr: Impossible de lire le dossier %s
hu: Nem lehet olvasni a %s könyvtárat
ja: ディレクトリ %s を読み取ることができません
pt_br: Não foi possível ler o diretório %s
sv: Kan inte läsa katalogen %s

source: Cannot stat %s
fr: Impossible de connaître le statut de %s
ja: %s の状態を確認できません
pt_br: Falha ao acessar o arquivo %s
sv: Kan inte ta status på %s

source: Invalid device %s
fr: Périphérique %s invalide
hu: Érvénytelen eszköz %s
ja: 無効なデバイス %s
pt_br: Dispositivo inválido %s
sv: Ogiltig enhet %s

source: Cannot get attributes of %s
fr: Impossible d'obtenir les attributs de %s
hu: Nem lehet lekérni a %s attribútumait
ja: %s の属性を取得できません
pt_br: Não foi possível ler os atributos %s
sv: Kan inte få attributen för %s

source: Invalid file name %s
fr: Nom de fichier %s invalide
hu: Érvénytelen fájlnév %s
ja: 無効なファイル名 %s
pt_br: Nome do arquivo inválido %s
sv: Ogiltigt filnamn %s

source: Unknown disk format
fr: Format de disque inconnu
hu: Ismeretlen lemezformátum
ja: 不明なディスクフォーマット
pt_br: Formato de disco desconhecido
sv: Okänt skivformat

source: This media cannot be loaded
fr: Ce média ne peut pas être chargé
hu: Ez a média nem tölthető be
ja: このメディアを読み込むことができません
pt_br: Essa mídia não pode ser carregada
sv: Detta media kan inte läsas in

source: Cannot open CUE file %s
fr: Impossible d'ouvrir le fichier CUE %s
hu: Nem lehet megnyitni a CUE fájlt %s
ja: CUEファイル %s を開くことができません
pt_br: Não foi possível abrir o arquivo CUE %s
sv: Kan inte öppna CUE-filen %s

source: CUE parse error: CUE file too big
fr: CUE invalide : fichier trop grand
hu: CUE elemzési hiba: A CUE fájl túl nagy
ja: CUE解析エラー: CUEファイルが大きすぎます
pt_br: Erro ao processar o CUE: Arquivo CUE muito grande
sv: Tolkningsfel för CUE: CUE-filen är för stor

source: CUE file: cannot open track %s
fr: Fichier CUE : impossible d'ouvrir la piste %s
hu: CUE fájl: nem lehet megnyitni ezt a sávot %s
ja: CUEファイル: トラック %s を開くことができません
pt_br: Arquivo CUE: Não foi possível abrir a faixa %s
sv: CUE-fil: kan inte öppna spår %s

source: CUE file: track has unknown sector type: %s
fr: Fichier CUE : la piste a un secteur de type inconnu : %s
hu: CUE fájl: a sáv ismeretlen szektortípusú: %s
ja: CUEファイル: トラックに不明なセクタータイプがあります: %s
pt_br: Arquivo CUE: Faixa possui um tipo de setor desconhecido %s
sv: CUE-fil: spåret har okänd sektortyp: %s

source: CUE parse error: failed to parse or invalid file with 0 tracks
fr: CUE invalide : fichier corrompu ou sans piste
hu: CUE-elemzési hiba: az elemzés sikertelen volt, vagy a fájl érvénytelen, 0 sávval
ja: CUE 解析エラー: 解析に失敗したか、トラックが0個の無効なファイルです
pt_br: Erro ao processar o CUE: Falha ao processar ou arquivo inválido com 0 faixas
sv: Tolkningsfel för CUE: misslyckades med att tolka eller ogiltig fil med 0 spår

source: Invalid CUE file
fr: Fichier CUE invalide
hu: Érvénytelen CUE fájl
ja: CUEファイルが無効です
pt_br: Arquivo CUE inválido
sv: Ogiltig CUE-fil

source: CUE parse error: less than 3 tracks
fr: CUE invalide : moins de 3 pistes
hu: CUE elemzési hiba: kevesebb mint 3 sáv
ja: CUE解析エラー: 3 トラック未満です
pt_br: Erro ao processar o CUE: menos que 3 faixas
sv: Tolkningsfel för CUE: mindre än 3 spår

source: chd: track type %s is not supported
fr: CHD : piste de type %s non supportée
hu: chd: a %s típusú sáv nem támogatott
ja: chd: トラックタイプ %s はサポートされていません
pt_br: chd: tipo de faixa %s não suportada
sv: chd: spårtypen %s stöds inte

source: Cannot open CHD file %s
fr: Impossible d'ouvrir le fichier CHD %s
hu: Nem lehet megnyitni a CHD fájlt %s
ja: CHDファイル %s を開くことができません
pt_br: Não foi possível abrir o arquivo CHD %s
sv: Kan inte öppna CHD-filen %s

source: Invalid CHD file %s
fr: Fichier CHD invalide
hu: Érvénytelen CHD fájl %s
ja: 無効なCHDファイル %s
pt_br: Arquivo CHD inválido %s
sv: Ogiltig CHD-fil %s

source: Invalid hunkbytes for CHD file %s
fr: Valeur 'hunkbytes' invalide pour le fichier CHD %s
hu: Érvénytelen hunkbytes a CHD fájlban %s
ja: CHDファイル %s のハンクサイズが無効です
pt_br: Tamanho de blocos inválidos para arquivo CHD %s
sv: Ogiltig hunkbytes för CHD-filen %s

source: Unexpected track number
fr: Numéro de piste invalide
hu: Váratlan sáv szám
ja: 予期しないトラック番号
pt_br: Número de faixa inesperada
sv: Oväntat spårnummer

source: Unsupported subtype or pre/postgap
fr: Sous-type ou pre/postgap non supporté
hu: Nem támogatott altípus vagy pre/postgap
ja: サポートされていないサブタイプまたはプリ/ポストギャップ
pt_br: Subtipo ou pré/pós-intervalo não suportado
sv: Undertypen stöds inte eller pre/postgap

source: Invalid CHD: less than 3 tracks
fr: CHD invalide : moins de 3 pistes
hu: Érvénytelen CHD: kevesebb mint 3 sáv
ja: 無効なCHD：3 トラック未満です
pt_br: CHD Inválido: Menos que 3 faixas
sv: Ogiltig CHD: mindre än 3 spår

source: Invalid CHD: no track found
fr: CHD invalide : aucune piste trouvée
hu: Érvénytelen CHD: nincsenek sávok
ja: 無効なCHD：トラックが見つかりません
pt_br: CHD inválido: Faixa não encontrada
sv: Ogiltig CHD: inga spår hittades

source: Cannot open GDI file %s
fr: Impossible d'ouvrir le fichier GDI %s
hu: Nem lehet megnyitni a GDI fájlt %s
ja: GDIファイル %s を開くことができません
pt_br: Não foi possível abrir o arquivo GDI %s
sv: Kan inte öppna GDI-filen %s

source: GDI file too big
fr: Fichier GDI trop grand
hu: Túl nagy GDI fájl
ja: GDIファイルが大きすぎます
pt_br: Arquivo GDI muito grande
sv: GDI-filen är för stor

source: Invalid GDI file
fr: Fichier GDI invalide
hu: Hibás GDI fájl
ja: GDIファイルが無効です
pt_br: Arquivo GDI inválido
sv: Ogiltig GDI-fil

source: GDI file: Cannot open track %s
fr: Fichier GDI : impossible d'ouvrir la piste %s
hu: GDI fájl: Nem lehet megnyitni a %s sávot
ja: GDIファイル: トラック %s を開くことができません
pt_br: Arquivo GDI: Não foi possível abrir a faixa %s
sv: GDI-fil: Kan inte öppna spår %s

source: Cannot open CDI file %s
fr: Impossible d'ouvrir le fichier CDI %s
hu: Nem lehet megnyitni a CDI fájlt %s
ja: CDIファイル %s を開くことができません
pt_br: Não foi possível abrir o arquivo CDI %s
sv: Kan inte öppna CDI-filen %s

source: Invalid CDI file %s
fr: Fichier CDI %s invalide
hu: Érvénytelen CDI fájl %s
ja: 無効なCDIファイル %s
pt_br: Arquivo CDI inválido %s
sv: Ogiltig CDI-fil %s

source: Invalid CDI image
fr: Image CDI invalide
hu: Hibás CDI fájl
ja: 無効なCDIイメージ
pt_br: Imagem CDI inválida
sv: Ogiltig CDI-avbildning

source: Invalid CDI sector size
fr: Taille de secteur CDI invalide
hu: Érvénytelen CDI szektorméret
ja: 無効なCDIセクターサイズ
pt_br: Tamanho setor do CDI inválido
sv: Ogiltig sektorstorlek för CDI

source: Cannot re-open CDI file
fr: Impossible de rouvrir le fichier CDI
hu: A CDI fájl nem nyitható meg újra
ja: CDIファイルを再度開くことができません
pt_br: Não foi possível reabrir o arquivo CDI
sv: Kan inte återöppna CDI-fil

source: Card ejected
fr: Carte éjectée
hu: Kártya kilökve
ja: カードが取り出されました
pt_br: Cartão ejetado
sv: Kortet utmatat

source: Speed: %3d
fr: Vitesse : %3d
hu: Sebesség: %3d
ja: 速度: %3d
pt_br: Velocidade: %3d
sv: Hastighet: %3d

source: Print out saved
fr: Impression sauvegardée
ja: 印刷を保存しました
pt_br: Impressão salva
sv: Utdata sparades

source: SystemSP: Cannot open CompactFlash file %s
fr: SystemSP : Impossible d'ouvrir le fichier CompactFlash %s
hu: SystemSP: Nem lehet megnyitni a CompactFlash fájlt %s
ja: SystemSP: CompactFlashファイル %s を開くことができません
pt_br: SystemSP: Não foi possível abrir o arquivo CompactFlash %s
sv: SystemSP: Kan inte öppna CompactFlash-filen %s

source: Network started
fr: Réseau démarré
hu: Hálózat elindítva
ja: ネットワークを開始しました
pt_br: Rede iniciada
sv: Nätverk startat

source: Memory allocation failed
fr: Erreur d'allocation mémoire
hu: Memóriaallokáció sikertelen
ja: メモリ割り当てに失敗しました
pt_br: Falha na alocação de memória
sv: Minnesallokering misslyckades

source: Error: cannot load BIOS %s
fr: Erreur : impossible de charger le BIOS %s
hu: Hiba: nem lehet betölteni a BIOS-t %s
ja: エラー: BIOS %s を読み込むことができません
pt_br: Erro: Não foi possível carregar a bios %s
sv: Fel: kan inte läsa in BIOS %s

source: Unknown game
fr: Jeu inconnu
hu: Ismeretlen játék
ja: 不明なゲーム
pt_br: Jogo desconhecido
sv: Okänt spel

source: Cannot open %s or %s
fr: Impossible d'ouvrir %s ou %s
hu: Cannot open %s / %s
ja: %s または %s を開くことができません
pt_br: Não foi possível abrir %s ou %s
sv: Kan inte öppna %s eller %s

source: Cannot open %s
fr: Impossible d'ouvrir %s
hu: Nem lehet megnyitni %s
ja: %s を開くことができません
pt_br: Não foi possível abrir %s
sv: Kan inte öppna %s

source: Invalid ROM
fr: ROM invalide
hu: Érvénytelen ROM
ja: 無効なROM
pt_br: ROM inválida
sv: Ogiltigt ROM

source: Cannot find %s
fr: Impossible de trouver %s
ja: %s が見つかりません
pt_br: Não foi possível encontrar %s
sv: Kan inte hitta %s

source: Invalid ROM: truncated %s
fr: ROM invalide : %s tronqué
ja: 無効なROM: %s が切り捨てられました
pt_br: ROM inválida: Corrompida %s
sv: Ogiltigt ROM: trunkerad %s

source: Error: cannot load BIOS from naomi.zip
fr: Erreur : impossible de charger le BIOS de 'naomi.zip'
ja: エラー: naomi.zipからBIOSを読み込むことができません
pt_br: Erro: Não foi possível carregar a Bios da naomi.zip
sv: Fel: kan inte läsa in BIOS från naomi.zip

source: Error: can't open %s
fr: Erreur : impossible d'ouvrir %s
ja: エラー: %s を開くことができません
pt_br: Erro: não foi possível abrir %s
sv: Fel: kan inte öppna %s

source: Error: Invalid LST file
fr: Erreur : fichier LST invalide
hu: Hiba: Érvénytelen LST fájl
ja: エラー: 無効なLSTファイル
pt_br: Erro: Arquivo LST inválido
sv: Fel: Ogiltig LST-fil

source: Invalid empty ROM
fr: ROM vide invalide
hu: Érvénytelen üres ROM
ja: 無効な空のROM
pt_br: ROM vazia inválida
sv: Ogiltig tom ROM

source: Out of memory
fr: Mémoire saturée
hu: Elfogyott a memória
ja: メモリ不足
pt_br: Memoria insuficiente
sv: Slut på minne

source: Error: Failed to load BIN/DAT file
fr: Erreur : échec de chargement du fichier BIN/DAT
hu: Hiba: A BIN/DAT fájl betöltése sikertelen
ja: エラー: BIN/DATファイルの読み込みに失敗しました
pt_br: Erro: Falha ao carregar o arquivo BIN/DAT
sv: Fel: Misslyckades med att läsa in BIN/DAT-fil

source: Calibration done
fr: Calibration terminée
hu: Kalibráció kész
ja: キャリブレーション完了
pt_br: Calibração finalizada
sv: Kalibreringen är klar

source: Calibrating the wheel. Keep it centered.
fr: Calibration du volant en cours. Gardez-le centré.
hu: A kormány kalibrálása. Tartsa középen.
ja: ホイールを調整中です。中心にしてください。
pt_br: Calibrando o volante. Mantenha-o centralizado.
sv: Kalibrerar ratten. Håll den centrerad.

source: Naomi GDROM: Cannot open %s.chd
fr: GDROM Naomi : impossible d'ouvrir %s.chd
hu: Naomi GDROM: Nem lehet megnyitni a %s.chd fájlt
ja: Naomi GDROM: %s.chdを開くことができません
pt_br: GDROM Naomi: Não foi possível abrir %s.chd
sv: Naomi GDROM: Kan inte öppna %s.chd

source: Naomi GDROM: Could not find the file to decrypt.
fr: GDROM Naomi : impossible de trouver le fichier à décrypter
hu: Naomi GDROM: Nem sikerült megtalálni a visszafejtendő fájlt.
ja: Naomi GDROM: 復号するファイルが見つかりませんでした。
pt_br: GDROM Naomi: Não foi possível encontrar o arquivo para descriptografar.
sv: Naomi GDROM: Kunde inte hitta filen att avkryptera.

source: ATTENTION: Loading from a physical VMU
fr: Attention : Chargement d'un VMU physique
hu: FIGYELEM: Betöltés fizikai VMU-ról
ja: 注意: 物理VMUからの読み込み
pt_br: ATENÇÃO: Carregando de um VMU físico
sv: OBSERVERA: Inläsning från en fysisk VMU

source: Game data is being loaded from your physical VMU
fr: Les données du jeu sont chargées à partir d'un VMU physique
hu: A játékadatok betöltése a fizikai VMU-ról történik
ja: ゲームデータが物理VMUから読み込まれています
pt_br: Dados do jogo estão sendo carregados de um VMU físico
sv: Speldata läses in från din fysiska VMU

source: ATTENTION: You are saving to a physical VMU
fr: Attention : Vous sauvegardez vers un VMU physique
hu: FIGYELEM: Fizikai VMU-ra ment
ja: 注意: 物理VMUに保存しています
pt_br: ATENÇÃO: Você está salvando em um VMU físico
sv: OBSERVERA: Du sparar till en fysisk VMU

source: Do not disconnect the VMU or close the game
fr: Ne pas déconnecter le VMU ou fermer le jeu
hu: Ne válassza le a VMU-t és ne zárja be a játékot
ja: VMUを切断したり、ゲームを終了しないでください
pt_br: Não desconecte o VMU ou feche o jogo
sv: Koppla inte från VMU:n eller stäng spelet

source: ATTENTION: Write to VMU failed
fr: Attention : L'écriture du VMU a échoué
hu: FIGYELEM: A VMU-ba történő írás sikertelen volt
ja: 注意: VMUへの書き込みに失敗しました
pt_br: ATENÇÃO: A Escrita no VMU falhou
sv: OBSERVERA: Skrivning till VMU misslyckades

source: WARNING: Disconnected from physical VMU memory due to load state
fr: Attention : Déconnecté du VMU physique dû au chargement d'un état
hu: FIGYELEM: A terhelés állapot miatt leválasztva a fizikai VMU memóriáról
ja: 警告: ロードステートが原因で物理VMUメモリから切断されました
pt_br: AVISO: Desconectado do VMU físico devido ao carregamento do estado
sv: VARNING: Frånkopplad från fysiskt VMU-minne på grund av inläst tillstånd

source: Reconnect manually to resume using physical VMU memory
fr: Reconnecter manuellement pour continuer à utiliser le VMU physique
hu: Csatlakoztassa újra manuálisan a fizikai VMU-t a folytatásához
ja: 物理VMUメモリの使用を再開するには手動で再接続してください
pt_br: Reconecte manualmente para continuar usando a memória do VMU físico
sv: Återanslut manuellt för att återuppta användning av fysiskt VMU-minne

source: Reboot to BIOS
fr: Redémarrage vers le BIOS
hu: Újraindítás a BIOS-ba
ja: BIOSへ再起動
pt_br: Reiniciar para BIOS
sv: Starta om till BIOS

source: Failed to open ELF %s
fr: Échec d'ouverture du fichier ELF %s
hu: Az ELF %s megnyitása sikertelen
ja: ELF %s を開けませんでした
pt_br: Falhou em abrir o ELF %s
sv: Misslyckades med att öppna ELF %s

source: Failed to locate bootfile %s
fr: Impossible de trouver le fichier de démarrage %s
hu: Nem sikerült megtalálni a %s rendszerindító fájlt
ja: ブートファイル %sの場所を特定できませんでした
pt_br: Falhou em localizar o arquivo de inicialização %s
sv: Misslyckades med att hitta bootfile %s

source: Naomi boot failure
fr: Erreur de démarrage Naomi
hu: Naomi rendszerindítási hiba
ja: Naomiブートエラー
pt_br: Naomi falha de inicialização
sv: Uppstartsfel för Naomi

source: Invalid cart size
fr: Taille de cartouche invalide
hu: Érvénytelen kártyaméret
ja: 無効なカートサイズ
pt_br: Tamanho do cartucho inválido
sv: Ogiltig kortstorlek

source: Invalid cheat code
fr: Code de triche invalide
hu: Érvénytelen csalókód
ja: 無効なチートコード
pt_br: Código de trapaça inválido
sv: Ogiltig fuskkod

source: Missing value
fr: Valeur manquante
hu: Hiányzó érték
ja: 値がありません
pt_br: Valor faltando
sv: Saknar värde

source: Missing values
fr: Valeurs manquantes
hu: Hiányzó értékek
ja: 値がありません
pt_br: Valores faltando
sv: Saknar värden

source: Missing address or value
fr: Adresse ou valeur manquante
hu: Hiányzó cím vagy érték
ja: アドレスまたは値がありません
pt_br: Valor ou endereço faltando
sv: Saknad adress eller värde

source: Unsupported cheat type
fr: Type de code de triche non supporté
hu: Nem támogatott csalási típus
ja: サポートされていないチートタイプ
pt_br: Código de trapaça não suportado
sv: Fusktypen stöds inte

source: Missing count or value
fr: Nombre ou valeur manquante
hu: Hiányzó számláló vagy érték
ja: カウントまたは値がありません
pt_br: Contador ou valor faltando
sv: Saknar antal eller värde

source: Missing count or destination address
fr: Nombre ou adresse de destination manquante
hu: Hiányzó számláló vagy célcím
ja: カウントまたは宛先アドレスがありません
pt_br: Contador ou endereço de destino faltando
sv: Saknar antal eller måladress

source: Master codes aren't supported
fr: Codes maîtres non supportés
hu: A mester kódok nem támogatottak
ja: マスター コードはサポートされていません
pt_br: Código mestre não suportado
sv: Masterkoder stöds inte

source: Unsupported conditional code
fr: Code conditionnel non supporté
hu: Nem támogatott feltételes kód
ja: サポートされていない条件コード
pt_br: Código condicional não suportado
sv: Villkorskoden stöds inte

source: Missing test address
fr: Adresse de test manquante
hu: Hiányzó tesztcím
ja: テストアドレスがありません
pt_br: Endereço de teste faltando
sv: Saknar testadress

source: Can't save cheat file
fr: Échec de sauvegarde du fichier de triche
hu: Nem lehet menteni a csaló fájlt
ja: チートファイルを保存できません
pt_br: Não foi possível salvar o arquivo de trapaça
sv: Kan inte spara fuskfil

source: Graphics API
fr: API Graphique
hu: Grafikus API
ja: グラフィックスAPI
pt_br: Gráficos API
sv: Grafik-API

source: MoltenVK: An implementation of Vulkan that runs on Apple's Metal graphics framework
fr: MoltenVK : Une implémentation de Vulkan qui utilise l'API Metal d'Apple
hu: MoltenVK: A Vulkan implementációja, amely az Apple Metal grafikus keretrendszerén fut
ja: MoltenVK: AppleのMetalグラフィックフレームワーク上で動作するVulkanの実装
pt_br: MoltenVK: Uma implementação do Vulkan que roda no framework gráfico Apple Metal
sv: MoltenVK: En implementation av Vulkan som körs på Apples grafiska ramverk Metal

source: Transparent Sorting
fr: Tri Surface Transparente
hu: Transzparens rendezés
ja: 透明な並べ替え
pt_br: Classificação Transparente
sv: Transparent sortering

source: Per Triangle
fr: Par Triangle
hu: Háromszögenként
ja: 三角形単位
pt_br: Por Triângulo
sv: Per triangel

source: Sort transparent polygons per triangle. Fast but may produce graphical glitches
fr: Trie les surfaces transparentes par triangle. Rapide mais peut produire des bogues graphiques
hu: Átlátszó sokszögek rendezése háromszögek szerint. Gyors, de grafikai hibákat okozhat
ja: 透明ポリゴンを三角形単位でソートします。高速ですが、グラフィックの不具合が発生する可能性があります
pt_br: Ordena os polígonos transparentes por triangulo. Rápido, mas pode gerar falhas gráficas
sv: Sortera transparenta polygoner per triangel. Snabbt men kan orsaka grafiska fel

source: Per Strip
fr: Par Polygone
hu: Sávonként
ja: ストリップ単位
pt_br: Por Faixa
sv: Per remsa
