Repository: flyinghead/flycast
Catalog: resources/i18n/*.po
Languages: fr, hu, ja, pt_br, sv

source: Sort transparent polygons per strip. Faster but may produce graphical glitches
fr: Trie les surfaces transparentes par polygone. Rapide mais peut produire des bogues graphiques
hu: Átlátszó sokszögek rendezése sávok szerint. Gyorsabb, de grafikai hibákat okozhat
ja: 透明ポリゴンをストリップ単位でソートします。高速ですが、グラフィックの不具合が発生する可能性があります
pt_br: Ordena os polígonos transparentes por faixa. Mais rápido, mas pode gerar mais falhas gráficas
sv: Sortera transparenta polygoner per remsa. Snabbare men kan producera grafiska artefakter

source: Per Pixel
fr: Par Pixel
hu: Képpontonként
ja: ピクセル単位
pt_br: Por Pixel

source: Sort transparent polygons per pixel. Slower but accurate
fr: Trie les surfaces transparentes par pixel. Plus lent mais fidèle
ja: 透明ポリゴンをピクセル単位でソートします。遅いですが正確です
pt_br: Ordena os polígonos transparentes por pixel. Mais lento, mas preciso
sv: Sortera transparenta polygoner per pixel. Långsammare men exakt

source: Rendering Options
fr: Options de rendu
hu: Renderelési beállítások
ja: レンダリングオプション
pt_br: Opções de Renderização
sv: Renderingsalternativ

source: Half
fr: Moitié
hu: Fél
ja: ハーフ
pt_br: Metade
sv: Halv

source: Native
fr: Natif
hu: Natív
ja: ネイティブ
pt_br: Nativo
sv: Inbyggd

source: Internal Resolution
fr: Résolution Interne
hu: Belső felbontás
ja: 内部解像度
pt_br: Resolução Interna
sv: Intern upplösning

source: Internal render resolution. Higher is better, but more demanding on the GPU. Values higher than your display resolution (but no more than double your display resolution) can be used for supersampling, which provides high-quality antialiasing without reducing sharpness.
fr: Résolution de rendu interne. Les valeurs plus élevées produisent des images plus fines mais consomment plus de ressources. Les valeurs supérieures à votre résolution d'écran produisent du sur-échantillonnage.
ja: 内部レンダリング解像度。高いほど画質は向上しますが、GPUへの負荷は高くなります。ディスプレイ解像度よりも高い値(ただしディスプレイ解像度の2倍以下)はスーパーサンプリングに使用でき、鮮明度を損なわずに高品質なアンチエイリアシングを実現します。
pt_br: Resolução de renderização Interna. Maior é melhor, mas demanda mais GPU. Valores mais alto que a resolução da sua tela (mas não mais do que o dobro da sua resolução) pode ser usada para superamostragem, que fornece alta qualidade de antialising sem reduzir a nitidez.
sv: Intern renderingsupplösning. Ju högre desto bättre, men desto högre krav på GPU:n. Värden som är högre än din skärmupplösning (men inte mer än dubbelt så höga som din skärmupplösning) kan användas för supersampling, vilket ger högkvalitativ antialiasing utan att skärpan minskar.

source: Integer Scaling
fr: Échelle Entière
hu: Egész számú skálázás
ja: 整数スケーリング
pt_br: Escala Inteira
sv: Heltalsskalning

source: Scales the output by the maximum integer multiple allowed by the display resolution.
fr: Augmente la résolution externe par paliers entiers.
ja: ディスプレイ解像度で許可される最大の整数倍で出力をスケーリングします。
pt_br: Dimensiona a saída pelo número máximo de inteiros permitidos pela resolução de exibição.
sv: Skalar utdata med det maximala heltal som tillåts av skärmupplösningen.

source: Linear Interpolation
fr: Interpolation Linéaire
hu: Lineáris interpoláció
ja: 線形補間
pt_br: Interpolação Linear
sv: Linjär interpolering

source: Scales the output with linear interpolation. Will use nearest neighbor interpolation otherwise. Disable with integer scaling.
fr: Utilise l'interpolation linéaire pour l'affichage final.
ja: 出力を線形補間でスケーリングします。そうでない場合は最近傍補間を使用します。整数スケーリングの場合は無効になります。
pt_br: Redimensiona a saída usando interpolação linear. Caso contrário, usará interpolação pelo vizinho mais próximo. Desative ao usar escala inteira.
sv: Skalar utdata med linjär interpolering. Annars används närmaste granninterpolering. Inaktivera med heltalsskalning.

source: VSync
fr: Synchronisation Verticale
ja: 垂直同期
pt_br: Sincronização Vertical

source: Synchronizes the frame rate with the screen refresh rate. Recommended
fr: Synchronise la production d'image avec la fréquence de rafraîchissement de l'écran. Recommandé
ja: フレームレートを画面のリフレッシュレートと同期します。推奨
pt_br: Sincroniza a taxa de quadros com a taxa de atualização de tela. Recomendado
sv: Synkroniserar bildfrekvensen med skärmens uppdateringsfrekvens. Rekommenderas

source: Duplicate frames
fr: Duplication des Trames
hu: Duplikált képkockák
ja: 重複フレーム
pt_br: Duplicar quadros
sv: Duplikata bildrutor

source: Duplicate frames on high refresh rate monitors (120 Hz and higher)
fr: Duplique les trames sur les moniteurs à haute fréquence de rafraîchissement (120 Hz et au-delà)
hu: Duplikált képkockák magas frissítési frekvenciájú monitorokon (120 Hz és magasabb)
ja: 高リフレッシュレートモニター上でフレームを複製(120 Hz以上)
pt_br: Quadros duplicados em monitores de alta taxa de atualização (120 Hz ou superior)
sv: Duplikata bildrutor på skärmar med hög uppdatingsfrekvens (120 Hz och högre)

source: Show VMU In-game
fr: Affichage LCD VMU
hu: VMU megjelenítése a játékban
ja: ゲーム内でVMUを表示する
pt_br: Mostrar VMU durante o jogo
sv: Visa VMU i spelet

source: Show the VMU LCD screens while in-game
fr: Affiche les écrans LCD VMU pendant le jeu
hu: A VMU LCD képernyők megjelenítése játék közben
ja: ゲーム中にVMUのLCD画面を表示する
pt_br: Mostrar a tela LCD do VMU enquanto joga
sv: Visa VMU-LCD-skärmarna i spelet

source: Full Framebuffer Emulation
fr: Émulation Framebuffer Complète
hu: Teljes képkockabuffer emuláció
ja: 完全なフレームバッファエミュレーション
pt_br: Emulação completa do Framebuffer
sv: Fullständig emulering av framebuffer

source: Fully accurate VRAM framebuffer emulation. Helps games that directly access the framebuffer for special effects. Very slow and incompatible with upscaling and wide screen.
fr: Émulation complète du framebuffer en VRAM. Améliore les jeux qui accèdent directement au framebuffer pour des effets spéciaux. Très lent et incompatible avec résolution interne et écran large.
ja: 完全に正確なVRAMフレームバッファエミュレーション。特殊効果のためにフレームバッファに直接アクセスするゲームに役立ちます。非常に遅く、アップスケーリングやワイドスクリーンには対応していません。
pt_br: Emulação totalmente precisa do framebuffer da VRAM. Útil em jogos que acessam diretamente o framebuffer para efeitos especiais. Muito lento e incompatível com upscaling e tela cheia.
sv: Helt korrekt VRAM-rambuffertemulering. Hjälper spel som direkt använder rambuffert för specialeffekter. Mycket långsam och oförenlig med uppskalning och bredbild.

source: Load Custom Textures
fr: Chargement Textures Personnalisées
hu: Egyéni textúrák betöltése
ja: カスタムテクスチャをロード
pt_br: Carregar Texturas Customizadas
sv: Läs in anpassade texturer

source: Load custom/high-res textures from data/textures/<game id>
fr: Charge les textures personnalisées/haute résolution situées dans le dossier 'data/textures/<id jeu>'
hu: Egyéni/nagy felbontású textúrák betöltése innen data/textures/<game id>
ja: data/textures/<ゲーム id>からカスタム/高解像度テクスチャをロードします
pt_br: Carregar texturas /alta-resolução customizadas de /data/texture<game id>
sv: Läs in anpassade/högupplösta texturer från data/textures/<game id>

source: Preload Custom Textures
fr: Préchargement Textures Personnalisées
hu: Egyéni textúrák előzetes betöltése
ja: カスタムテクスチャをプリロード
pt_br: Pré-carregar texturas customizadas
sv: Förinläs anpassade texturer

source: Preload custom textures at game start. May improve performance but increases memory usage
fr: Précharge toutes les textures au démarrage du jeu. Améliore les performances mais augmente l'utilisation mémoire
hu: A játék indításakor előre betölti az egyéni textúrákat. Javíthatja a teljesítményt, de növeli a memóriahasználatot
ja: ゲーム開始時にカスタムテクスチャをプリロードします。パフォーマンスが向上するかもしれませんが、メモリ使用量が増加します
pt_br: Pré-carregar texturas customizadas no início do jogo. Pode melhorar o desempenho, mas aumenta o uso de memória
sv: Förinläs anpassade texturer vid spelstart. Kan förbättra prestandan men ökar minnesanvändningen

source: Aspect Ratio
fr: Format d'Image
hu: Képarány
ja: アスペクト比
pt_br: Proporção da imagem
sv: Bildförhållande

source: Widescreen
fr: Écran Large
hu: Szélesvásznú
ja: ワイドスクリーン
pt_br: Tela Cheia
sv: Bredbild

source: Draw geometry outside of the normal 4:3 aspect ratio. May produce graphical glitches in the revealed areas. Aspect Fit and shows the full 16:9 content.
fr: Affiche la géométrie en dehors du format normal 4:3. Peut produire des bogues graphiques dans les zones larges. Affiche l'écran 16:9 complet.
ja: 通常の4:3 アスペクト比の外側にジオメトリを描画します。表示されている領域にグラフィックの不具合が発生する可能性があります。 アスペクトフィットで、16:9の全コンテンツを表示します。
pt_br: Desenha a geometria fora da relação de 4:3 normal. Pode produzir falhas gráficas nas áreas exibidas. Ajusta a imagem e mostra todo o conteúdo em 16:9.
sv: Rita geometri utanför det normala bildförhållandet 4:3. Kan orsaka grafiska fel i de synliga områdena. Bildanpassning och visar hela innehållet i 16:9.

source: Super Widescreen
fr: Écran Super Large
hu: Szuper széles képernyő
ja: スーパーワイドスクリーン
pt_br: Super Tela Cheia
sv: Superbredbild

source: Use the full width of the screen or window when its aspect ratio is greater than 16:9. Aspect Fill and remove black bars. Not compatible with integer scaling.
fr: Utilise la largeur complète l'écran ou de la fenêtre lorsque son format est supérieur à 16:9. Remplit l'écran cible et élimine les barres noires. Incompatible avec Échelle Entière.
hu: Használja a képernyő vagy ablak teljes szélességét, ha annak képaránya nagyobb, mint 16:9. Kitölti a képernyőt, eltávolítja a fekete sávokat. Nem kompatibilis az egész számú méretezéssel.
ja: アスペクト比が16:9より大きい場合は、画面またはウィンドウの最大幅を使用します。 アスペクト塗りつぶしと黒いバーを削除します。整数のスケーリングと互換性がありません。
pt_br: Usa toda a largura da tela ou janela quando a proporção for maior que 16:9. Preenchimento do aspecto remove as barras pretas. Não compatível com escala inteira.
sv: Använd hela skärmens eller fönstrets bredd när bildförhållandet är större än 16:9. Bildfyllning och ta bort svarta fält. Inte kompatibelt med heltalsskalning.

source: Widescreen Game Cheats
fr: Codes de Triche Écran Large
hu: Szélesképernyős játék csalások
ja: ワイドスクリーンゲームチート
pt_br: Trapaças em Jogos com Tela Cheia
sv: Fusk för bredbildsspel

source: Modify the game so that it displays in 16:9 anamorphic format and use horizontal screen stretching. Only some games are supported.
fr: Modifie le jeu pour qu'il affiche son image en 16:9 anamorphique, et utilise l'étirement horizontal. Seuls certains jeux sont supportés.
hu: Módosítja a játékot, hogy 16:9 anamorf formátumban jelenjen meg, és vízszintes képernyőnyújtást használ. Csak néhány játék támogatott.
ja: 16:9 アナモルフィック形式で表示されるようにゲームを変更し、水平スクリーンストレッチを使用します。一部のゲームのみサポートされています。
pt_br: Modifica o jogo para ser exibido em formato anamórfico 16:9 e usa o alongamento de tela horizontal. Apenas alguns jogos são suportados.
sv: Ändra spelet så att det visas i 16:9 anamorfiskt format och använd horisontell skärmutsträckning. Endast vissa spel stöds.

source: Horizontal Stretching
fr: Étirement Horizontal
hu: Vízszintes nyújtás
ja: 水平方向のストレッチ
pt_br: Alongamento Horizontal
sv: Horisontell utsträckning

source: Stretch the screen horizontally
fr: Augmente la largeur de l'écran
hu: Kinyújtja a képernyőt vízszintesen
ja: 画面を水平方向に伸ばします
pt_br: Esticar a tela horizontalmente
sv: Sträck ut skärmen horisontellt

source: Rotate Screen 90°
fr: Rotation Écran 90°
hu: Képernyő elforgatása 90°-kal
ja: 画面を 90°回転
pt_br: Girar a tela 90°
sv: Rotera skärm 90°

source: Rotate the screen 90° counterclockwise
fr: Effectue une rotation de l'écran de 90° dans le sens anti-horaire
hu: Elforgatja a képernyőt 90°-kal az óramutató járásával ellentétes irányban
ja: 画面を反時計回りに 90°回転します
pt_br: Girar a tela 90° no sentido anti-horário
sv: Rotera skärmen 90° motsols

source: Per Pixel Settings
fr: Préférences Par Pixel
hu: Pixelenkénti beállítások
ja: ピクセル単位の設定
pt_br: Configurações por Pixel
sv: Inställningar per pixel

source: Pixel Buffer Size
fr: Taille Tampon Pixels
hu: Pixel puffer mérete
ja: ピクセルバッファサイズ
pt_br: Tamanho do Buffer de Pixel
sv: Storlek för pixelbuffert

source: The size of the pixel buffer. May need to be increased when upscaling by a large factor.
fr: La taille du tampon de pixels. Augmenter la résolution interne demande un tampon de pixels plus grand.
hu: A pixelpuffer mérete. Nagy mértékű felbontásnövelés esetén növelni kell.
ja: ピクセルバッファのサイズ。大きな係数でアップスケールする場合は、サイズを大きくする必要がある場合があります。
pt_br: Tamanho do buffer de pixels. Aumente ao usar upscaling alto.
sv: Storleken för pixelbufferten. Kan behöva att ökas vid större uppskalningar.

source: Maximum Layers
fr: Couches Maximum
hu: Rétegek max. száma
ja: 最大レイヤー数
pt_br: Máximo de camadas
sv: Maximala lager

source: Maximum number of transparent layers. May need to be increased for some complex scenes. Decreasing it may improve performance.
fr: Nombre maximum de couches transparentes. Des scènes complexes peuvent nécessiter plus de couches. Diminuer le nombre de couches peut augmenter les performances.
hu: Az átlátszó rétegek maximális száma. Bizonyos összetett jelenetek esetén növelni kell. Csökkentésével javulhat a teljesítmény.
ja: 透明レイヤーの最大数。複雑なシーンでは、この値を増やす必要がある場合があります。この値を減らすとパフォーマンスが向上する場合があります。
pt_br: Máximo de camadas transparentes. Aumente para cenas complexas; diminuir melhora desempenho.
sv: Maximalt antal transparenta lager. Kan behöva att ökas för vissa komplexa scener. Minska det kan förbättra prestandan.

source: Performance
fr: Performances
hu: Teljesítmény
ja: パフォーマンス
pt_br: Desempenho
sv: Prestanda

source: Automatic Frame Skipping:
fr: Saut d'Image Automatique :
hu: Automatikus képkocka-kihagyás:
ja: 自動フレームスキップ：
pt_br: Pular Quadros Automaticamente:
sv: Hoppa automatiskt över bildrutor:

source: Disabled
fr: Désactivé
hu: Letiltva
ja: 無効
pt_br: Desabilitado
sv: Inaktiverad

source: No frame skipping
fr: Pas de saut
hu: Nincs képkocka kihagyás
ja: フレームスキップなし
pt_br: Não Pular Quadros
sv: Hoppa inte över bildrutor

source: Normal
hu: Normál
ja: 通常

source: Skip a frame when the GPU and CPU are both running slow
fr: Saute une image quand le CPU et le GPU sont surchargés
hu: Képkockák kihagyása, ha a GPU és a CPU egyaránt lassú
ja: GPUとCPUの両方が遅い場合はフレームをスキップする
pt_br: Pular um quadro quando a GPU e a CPU estiverem lentas
sv: Hoppa över en bildruta när GPU och CPU båda kör långsamt

source: Maximum
ja: 最大
pt_br: Máximo
sv: Maximal

source: Skip a frame when the GPU is running slow
fr: Saute une image quand le GPU est surchargé
hu: Képkocka kihagyása, ha a GPU lassú
ja: GPUが遅いときはフレームをスキップします
pt_br: Pular um quadro quando a GPU estiver lenta
sv: Hoppa över en bildruta när GPU kör långsamt

source: Frame Skipping
fr: Saut d'Image
hu: Képkocka kihagyás
ja: フレームスキップ
pt_br: Pular Quadros
sv: Hoppa över bildrutor

source: Number of frames to skip between two actually rendered frames
fr: Nombre d'images à sauter entre chaque image affichée
hu: Két ténylegesen renderelt képkocka között kihagyott képkockák száma
ja: 実際にレンダリングされた2つのフレーム間をスキップするフレーム数
pt_br: Número de quadros para pular entre dois quadros renderizados
sv: Antal bildrutor att hoppa över mellan två faktiskt renderade bildrutor

source: Shadows
fr: Ombres
hu: Árnyékok
ja: シャドウ
pt_br: Sombras
sv: Skuggor

source: Enable modifier volumes, usually used for shadows
fr: Active les "modifier volumes", habituellement utilisés pour générer des ombres portées
ja: 通常は影に使用されるモディファイアボリュームを有効にします
pt_br: Ativar modificadores de volumes, geralmente usados para sombras
sv: Aktivera modifieringsvolymer, oftast använda för skuggor

source: Fog
fr: Brouillard
hu: Köd
ja: フォグ
pt_br: Névoa
sv: Dimma

source: Enable fog effects
fr: Active les effets de brouillard
hu: Ködhatások engedélyezése
ja: 霧の効果を有効にする
pt_br: Ativar efeito de Névoa
sv: Aktivera dimmeffekter

source: Advanced
fr: Avancé
hu: Haladó
ja: 高度な設定
pt_br: Avançado
sv: Avancerat

source: Delay Frame Swapping
fr: Délai Échange de Trame
hu: Késleltetett képkocka-csere
ja: 遅延フレームスワッピング
pt_br: Atrasar troca de quadro
sv: Fördröj växling av bildrutor

source: Useful to avoid flashing screen or glitchy videos. Not recommended on slow platforms
fr: Utile pour éviter les écrans clignotants et les problèmes vidéo. Pas recommandé sur les plateformes lentes
ja: 画面の点滅や動画の不具合を防ぐのに役立ちます。ただし、低速なプラットフォームでは推奨されません
pt_br: Útil para evitar telas intermitentes ou defeitos de vídeo. Não recomendado em plataformas lentas
sv: Användbart för att undvika blinkande skärm eller hackiga videor. Rekommenderas inte på långsamma plattformar

source: Fix Upscale Bleeding Edge
fr: Correction du Bord Débordant des Textures
ja: アップスケーリング滲み修正
pt_br: Corrigir vazamento nas bordas do upscaling
sv: Fixa blödande kant vid uppskalning

source: Helps with texture bleeding case when upscaling. Disabling it can help if pixels are warping when upscaling in 2D games (MVC2, CVS, KOF, etc.)
fr: Améliore les problèmes de bord débordant des textures avec une résolution interne non native. Peut créer des problèmes avec certains jeux 2D (MvsC2, CVS, KOF, etc.)
ja: アップスケーリング時のテクスチャの滲みを軽減します。2Dゲーム(MVC2、CVS、KOFなど)でアップスケーリング時にピクセルが歪む場合は、無効にすることで改善される可能性があります
pt_br: Ajuda com vazamento de textura ao mudar escala. Desativar pode ajudar se os píxeis estão deformados pela mudança de escala em jogos 2D (MVC2, CVS, KOF etc.)
sv: Hjälper till med texturblödning vid uppskalning. Att inaktivera den kan hjälpa om pixlarna förvrängs vid uppskalning i 2D-spel (MVC2, CVS, KOF, etc.)

source: Native Depth Interpolation
fr: Interpolation Profondeur Native
ja: ネイティブ深度補完
pt_br: Interpolação de Profundidade Nativa
sv: Inbyggd djupinterpolering

source: Helps with texture corruption and depth issues on AMD GPUs. Can also help Intel GPUs in some cases.
fr: Améliore les problèmes de corruption de texture et problèmes de profondeur avec les processeurs graphiques AMD. Peut aussi aider avec les processeurs Intel dans certains cas.
ja: AMD GPUのテクスチャ破損や深度の問題の解決に役立ちます。場合によってはIntel GPUでも効果があります。
pt_br: Ajuda com corrupção de textura e problemas de profundidade em GPU da AMD. Pode ajudar em GPU da Intel em alguns casos.
sv: Hjälper till med texturförvrängning och djupproblem på AMD-grafikprocessorer. Kan även hjälpa Intel-grafikprocessorer i vissa fall.

source: Copy Rendered Textures to VRAM
fr: Copie Textures Générés en VRAM
hu: Renderelt textúrák másolása a VRAM-ba
ja: レンダリングされたテクスチャをVRAMにコピーする
pt_br: Copiar Texturas Renderizadas para VRAM
sv: Kopiera renderade texturer till VRAM

source: Copy rendered-to textures back to VRAM. Slower but accurate
fr: Copie les textures générées par le jeu en VRAM. Plus lent mais plus fidèle
hu: A renderelt textúrákat visszamásolja a VRAM-ba. Lassabb, de pontos
ja: レンダリングされたテクスチャをVRAMにコピーします。遅いですが正確です
pt_br: Copiar texturas renderizadas de volta para VRAM. Mais lento porém preciso
sv: Kopiera renderade-till-texturer tillbaka till VRAM. Långsammare men exakta

source: Anisotropic Filtering
fr: Filtre Anisotrope
hu: Anizotropikus szűrés
ja: 異方性フィルタリング
pt_br: Filtragem anisotrópica
sv: Anisotropisk filtrering

source: Higher values make textures viewed at oblique angles look sharper, but are more demanding on the GPU. This option only has a visible impact on mipmapped textures.
fr: Les valeurs plus élevées rendent les textures vues sous un angle obliques plus précises, mais demandent plus de puissance graphique. Cette option n'a un impact visible que sur les textures avec mipmap.
hu: A magasabb értékek a ferde szögből nézett textúrákat élesebbé teszik, de nagyobb terhelést jelentenek a GPU-ra. Ez az opció csak a mipmappelt textúrákra gyakorol látható hatást.
ja: 値を大きくすると、斜めから見たテクスチャがより鮮明に見えますが、GPUへの負荷が高くなります。このオプションは、ミップマップテクスチャにのみ目に見える影響を与えます。
pt_br: Valores maiores fazem com que as texturas vistas em ângulos ofuscados pareçam mais nítidos, mas são mais exigentes com a GPU. Esta opção só tem um impacto visível em texturas mipmapeadas.
sv: Högre värden gör att texturer som ses i sneda vinklar ser skarpare ut, men ställer högre krav på GPU:n. Det här alternativet har bara en synlig effekt på mipmappade texturer.

source: Texture Filtering:
fr: Filtrage Texture :
ja: テクスチャフィルタリング：
pt_br: Filtragem de Texturas:
sv: Texturfiltrering:

source: Default
fr: Défaut
hu: Alapértelmezett
ja: デフォルト
pt_br: Padrão
sv: Standard

source: Use the game's default texture filtering
fr: Utiliser le filtre demandé par le jeu
ja: ゲームのデフォルトのテクスチャフィルタリングを使用する
pt_br: Usar filtragem de texturas padrão do jogo
sv: Använd spelets standardfiltrering för texturer

source: Force Nearest-Neighbor
fr: Forcer Proche Voisin
ja: 最近傍法を強制
pt_br: Forçar Mais Próximo
sv: Tvinga närmaste granne

source: Force nearest-neighbor filtering for all textures. Crisper appearance, but may cause various rendering issues. This option usually does not affect performance.
fr: Force le filtrage plus proche voisin sur toutes les textures. Apparence plus nette, mais peut causer des problèmes de rendu graphique. Cette option normalement n'affecte pas les performances.
ja: すべてのテクスチャに最近傍補間フィルタリングを強制的に適用します。見た目は鮮明になりますが、レンダリングに様々な問題が発生する可能性があります。このオプションは通常、パフォーマンスに影響を与えません。
pt_br: Forçar filtragem mais próxima para todas as texturas. Aparência mais nítida, mas pode causar vários problemas de renderização. Esta opção geralmente não afeta o desempenho.
sv: Tvinga närmaste grannfiltrering för alla texturer. Skarpare utseende, men kan orsaka olika renderingsproblem. Det här alternativet påverkar vanligtvis inte prestandan.

source: Force Linear
fr: Forcer Linéaire
ja: 線形法を強制
pt_br: Força Linear
sv: Tvinga linjär

source: Force linear filtering for all textures. Smoother appearance, but may cause various rendering issues. This option usually does not affect performance.
fr: Force le filtrage linéaire sur toutes les textures. Apparence plus réaliste, mais peut causer des problèmes de rendu graphique. Cette option normalement n'affecte pas les performances.
ja: すべてのテクスチャに線形フィルタリングを強制します。見た目は滑らかになりますが、レンダリングに様々な問題が発生する可能性があります。このオプションは通常、パフォーマンスに影響を与えません。
pt_br: Forçar filtragem linear para todas as texturas. Aparência suave, mas pode causar vários problemas de renderização. Esta opção geralmente não afeta o desempenho.
sv: Tvinga linjär filtrering för alla texturer. Jämnare utseende, men kan orsaka olika renderingsproblem. Det här alternativet påverkar vanligtvis inte prestandan.

source: Show FPS Counter
fr: Affichage Images/Seconde
hu: FPS számláló mutatása
ja: FPSカウンターを表示
pt_br: Mostrar contador de FPS
sv: Visa bildfrekvensräknare

source: Show on-screen frame/sec counter
fr: Affiche le compteur d'images par seconde à l'écran
ja: FPSカウンターを表示する
pt_br: Mostrar contador de quadros/segundos na tela
sv: Visa skärmräknare för bildfrekvens

source: Video Routing (Syphon)
fr: Routage Vidéo (Syphon)
ja: ビデオルーティング(Syphon)
pt_br: Roteamento de Vídeo (Syphon)

source: Video Routing (Spout)
fr: Routage Vidéo (Spout)
ja: ビデオルーティング(Spout)
pt_br: Roteamento de Vídeo (Spout)

source: Video Routing (Only available with OpenGL or DirectX 11)
fr: Routage Vidéo (Seulement disponible avec OpenGL ou DirectX 11)
ja: ビデオルーティング(OpenGLまたはDirectX 11でのみ利用可能)
pt_br: Roteamento de Vídeo (Somente disponível com OpenGL ou DirectX 11)
sv: Videorouting (Endast tillgängligt med OpenGL eller DirectX 11)

source: Send video content to another program
fr: Envoie la sortie vidéo vers une autre application
ja: ビデオコンテンツを別のプログラムに送信する
pt_br: Enviar conteúdo de vídeo para outro programa
sv: Skicka videoinnehåll till ett annat program

source: e.g. Route GPU texture to OBS Studio directly instead of using CPU intensive Display/Window Capture
fr: Permet le partage du flux de sortie vidéo avec OBS Studio sans utiliser la capture de fenêtre ou d'écran
ja: 例えば、CPUを集中的に使用するディスプレイ/ウィンドウキャプチャを使用する代わりに、GPUテクスチャをOBS Studioに直接ルーティングする
pt_br: ex.: encaminhar a textura da GPU diretamente para o OBS Estúdio em vez de usar a captura de Tela/Janela, que consome muita CPU
sv: t.ex. route GPU-textur till OBS Studio direkt istället för att använda CPU-intensiv skärm-/fönsterfångst

source: Scale down before sending
fr: Réduit la taille de l'image avant l'envoi
ja: 送信する前にスケールダウン
pt_br: Diminuir escala antes de enviar
sv: Skala ner före sändning
