Repository: flyinghead/flycast
Catalog: resources/i18n/*.po
Languages: fr, hu, ja, pt_br, sv

source: Middle Button
hu: Középső gomb
ja: 中央ボタン
pt_br: Botão do meio
sv: Mittenknapp

source: Touch Mouse
ja: タッチマウス
pt_br: Toque do Mouse

source: Cannot initialize the graphics API
fr: Impossible d'initialiser l'API graphique
ja: グラフィックAPIを初期化できません
pt_br: Não é possível inicializar a API gráfica
sv: Kan inte initiera grafik-API

source: Cannot run without JIT
fr: Impossible de fonctionner sans JIT
ja: JITなしでは実行できません
pt_br: Não é possível executar sem JIT
sv: Kan inte köra utan JIT

source: DPad Center
ja: DPad 中央
pt_br: Dpad Centro

source: Select
hu: Kiválaszt
ja: 選択
pt_br: Selecionar

source: Mode
hu: Mód
ja: モード
pt_br: Modo
sv: Läge

source: Gas
hu: Gáz
ja: ガス
pt_br: Gás

source: Brake
hu: Fék
ja: ブレーキ
pt_br: Freio
sv: Broms

source: Rudder
ja: ラダー
pt_br: Leme
sv: Roder

source: Wheel
ja: ホイール
pt_br: Roda
sv: Ratt

source: Throttle
ja: スロットル
pt_br: Acelerador
sv: Hastighetsreglage

source: Memory initialization failed
ja: メモリの初期化に失敗しました
pt_br: Falha na alocação de memória
sv: Minnesinitiering misslyckades

source: Storage access failed: %s
ja: ストレージへのアクセスに失敗しました: %s
pt_br: Falha no acesso ao armazenamento: %s
sv: Lagringsåtkomst misslyckades: %s

source: MFi Gamepad
ja: MFiゲームパッド
pt_br: Iphone Gamepad

source: Options
hu: Beállítások
ja: オプション
pt_br: Opções

source: Home
hu: Kezdőlap
ja: ホーム
pt_br: Início

source: Share
hu: Megosztás
ja: 共有
pt_br: Compartilhar

source: Not supported on Switch
fr: Pas supporté sur Switch
ja: Switchではサポートされていません
pt_br: Não suportado no Switch
sv: Stöds inte på Switch

source: HLE BIOS
fr: BIOS HLE
pt_br: BIOS HLE

source: Dreamcast 32MB RAM Mod
fr: Mod RAM Dreamcast 32 Mo
pt_br: Dreamcast modificação de 32 MB de RAM

source: 512 MB
fr: 512 Mo

source: 1 GB
fr: 1 Go

source: 2 GB
fr: 2 Go

source: 4 GB
fr: 4 Go

source: Sega VMU
fr: VMU Sega

source: NAT
fr: Translation d'adresse (NAT)
