Repository: flyinghead/flycast
Catalog: resources/i18n/*.po
Languages: fr, hu, ja, pt_br, sv

source: Could increase performance when sharing a smaller texture, YMMV
fr: Peut améliorer les performances en partageant une texture plus petite
ja: 小さなテクスチャを共有するとパフォーマンスが向上する可能性がありますが、状況によって異なる場合があります
pt_br: Pode aumentar o desempenho ao compartilhar uma textura menor, YMMV
sv: Kan öka prestandan vid delning av en mindre textur, din upplevelse kan variera

source: Output vertical resolution
fr: Résolution verticale de sortie
ja: 出力垂直解像度
pt_br: Resolução vertical de saída
sv: Vertikal upplösning för utdata

source: Output texture size: %d x %d
fr: Taille de la texture de sortie : %d x %d
ja: 出力テクスチャのサイズ: %d x %d
pt_br: Tamanho da textura de saída: %d x %d
sv: Texturstorlek för utdata: %d x %d

source: Set
fr: Choisir
hu: Beállítás
ja: セット
pt_br: Definir
sv: Ställ in

source: Add
fr: Ajouter
hu: Hozzáadás
ja: 追加
pt_br: Adicionar
sv: Lägg till

source: Select a Content Folder
fr: Sélectionner un dossier de jeux
ja: コンテンツフォルダを選択
pt_br: Selecionar uma pasta de conteúdo
sv: Välj en innehållsmapp

source: Japanese
fr: Japonais
hu: Japán
ja: 日本語
pt_br: Japonês
sv: Japanska

source: English
fr: Anglais
hu: Angol
ja: 英語
pt_br: Inglês
sv: Engelska

source: German
fr: Allemand
hu: Német
ja: ドイツ語
pt_br: Alemão
sv: Tyska

source: French
fr: Français
hu: Francia
ja: フランス語
pt_br: Francês
sv: Franska

source: Spanish
fr: Espagnol
hu: Spanyol
ja: スペイン語
pt_br: Espanhol
sv: Spanska

source: Italian
fr: Italien
hu: Olasz
ja: イタリア語
pt_br: Italiano
sv: Italienska

source: Language
fr: Langage
hu: Nyelv
ja: 言語
pt_br: Idioma
sv: Språk

source: The language as configured in the Dreamcast BIOS
fr: Le langage configuré dans le BIOS Dreamcast
ja: ドリームキャストBIOSで設定されている言語
pt_br: O idioma conforme configurado na Bios do Dreamcast
sv: Språket som konfigurerats i Dreamcast BIOS

source: Broadcast
fr: Standard TV
hu: Közvetítés
ja: ブロードキャスト
pt_br: Transmitir
sv: Sändning

source: TV broadcasting standard for non-VGA modes
fr: Le standard de diffusion TV pour les modes autre que VGA
ja: 非VGAモードのテレビ放送規格
pt_br: Padrão de transmissão de TV para modos não-VGA
sv: TV-sändningens standard för icke-VGA-lägen

source: Japan
fr: Japon
hu: Japán
ja: 日本
pt_br: Japão

source: USA
fr: États-Unis
hu: Egyesült Államok
ja: 米国
pt_br: EUA

source: Europe
hu: Európa
ja: ヨーロッパ
pt_br: Europa
sv: Europa

# region
source: Export
hu: Exportálás
ja: エクスポート
pt_br: Exportar
sv: Exportera

source: Korea
fr: Corée
ja: 韓国
pt_br: Coreia

source: Region
fr: Région
hu: Régió
ja: リージョン
pt_br: Região

source: BIOS region
fr: Région du BIOS
hu: BIOS régió
ja: BIOSリージョン
pt_br: Região da BIOS

source: RGB Component
fr: Composants RVB
ja: RGB
pt_br: RGB Componente
sv: RGB-komponent

source: TV Composite
fr: Vidéocomposite
ja: コンポジット
pt_br: Cabo Composto
sv: Tv-komposit

source: Cable
fr: Câble
hu: Kábel
ja: ケーブル
pt_br: Cabo
sv: Kabel

source: Video connection type
fr: Type de connexion vidéo
ja: ビデオ接続タイプ
pt_br: Tipo de conexão vídeo
sv: Typ av videoanslutning

source: Content Location
fr: Emplacements de contenu
ja: コンテンツの場所
pt_br: Localização do conteúdo
sv: Innehållsplats

source: Rescan Content
fr: Rescanner le contenu
hu: Tartalom újbóli beolvasása
ja: コンテンツを再スキャン
pt_br: Escanear conteúdo novamente
sv: Sök igenom innehåll igen

source: The folders where your games are stored
fr: Les dossiers où sont stockés vos jeux
ja: ゲームが保存されているフォルダー
pt_br: As pastas onde seus jogos estão armazenados
sv: Mappar där dina spel lagras

source: Data Folder
fr: Dossier de Données
hu: Adatmappa
ja: データフォルダー
pt_br: Pasta de Dados
sv: Datamapp

source: The folder containing BIOS files, as well as saved VMUs and states
fr: Le dossier contenant les fichiers BIOS, ainsi que les sauvegardes VMU et d'état
hu: A BIOS fájlokat, valamint a mentett VMU-kat és állapotokat tartalmazó mappa
ja: BIOSファイル、保存されたVMU、ステートを含むフォルダー
pt_br: A pasta que contém arquivos BIOS, assim como estados salvos e VMUs salvos
sv: Mappen som innehåller BIOS-filer, samt sparade VMUer och tillstånd

source: Home Folder
fr: Dossier Principal
hu: Kezdőmappa
ja: ホームフォルダー
pt_br: Pasta principal
sv: Hemmapp

# action
source: Import
fr: Importer
hu: Importálás
ja: インポート
pt_br: Importar
sv: Importera

# action
source: Export
fr: Exporter
hu: Exportálás
ja: エクスポート
pt_br: Exportar
sv: Exportera

source: Reveal in Finder
fr: Afficher dans le Finder
hu: Megjelenítés a Finderben
ja: Finderで表示
pt_br: Mostrar no Finder
sv: Visa i Finder

source: The folder where Flycast saves configuration files and VMUs. BIOS files should be in a subfolder named "data"
fr: Le dossier où Flycast sauvegarde les fichiers de configuration et les VMUs. Les fichiers BIOS doivent être dans un sous-dossier nommé "data"
hu: A mappa, amelyben a Flycast a konfigurációs fájlokat és a VMU-kat tárolja. A BIOS-fájloknak a „data” nevű almappában kell lenniük
ja: Flycastが設定ファイルとVMUを保存するフォルダー。BIOSファイルはdataという名前のサブフォルダーに保存されます
pt_br: A pasta onde o Flycast salva os arquivos de configuração e VMUs. Os arquivos de BIOS devem estar em uma subpasta chamada "data"
sv: Mappen där Flycast sparar konfigurationsfiler och VMUer. BIOS-filer bör vara i en undermapp som heter "data"

source: Box Art Game List
fr: Liste jeu avec images
hu: Borítóképes lista
ja: ボックスアートゲームリスト
pt_br: Lista de Jogos de Arte de Caixa
sv: Spellista med omslagsbilder

source: Display game cover art in the game list.
fr: Affiche des images des couvertures dans la liste de jeu.
hu: A játékborító megjelenítése a játéklistán.
ja: ゲームリストにゲームカバーアートを表示します。
pt_br: Exibir capa do jogo na lista de jogos.
sv: Visa spelets omslagsbild i spellistan.

source: Fetch Box Art
fr: Télécharger les couvertures
hu: Borítóképek letöltése
ja: ボックスアートを取得する
pt_br: Buscar Arte da Caixa
sv: Hämta omslagsbilder

source: Fetch cover images from TheGamesDB.net.
fr: Télécharge les couvertures de TheGamesDB.net.
hu: Borítóképek letöltése a TheGamesDB.net webhelyről.
ja: TheGamesDB.netからカバー画像を取得します。
pt_br: Buscar imagens no TheGamesDB.net.
sv: Hämta omslagsbilder från TheGamesDB.net.

source: UI Scaling
fr: Mise à l'échelle de l'interface
hu: UI méretezés
ja: UIのスケーリング
pt_br: Dimensionamento da Interface
sv: Skalning av grafiskt gränssnitt

source: Adjust the size of UI elements and fonts.
fr: Règle la taille des éléments d'interface et des polices de caractères.
hu: Az UI elemek és betűtípusok méretének beállítása.
ja: UI の要素とフォントのサイズを調整します。
pt_br: Ajuste o tamanho dos elementos e fontes da ‘interface’.
sv: Justera storlek för gränssnittselement och typsnitt.

source: Apply
fr: Appliquer
hu: Alkalmazás
ja: 適用する
pt_br: Aplicar
sv: Tillämpa

source: Dark
fr: Sombre
hu: Sötét
ja: ダーク
pt_br: Escuro
sv: Mörk

source: Light
fr: Clair
hu: Világos
ja: ライト
pt_br: Claro
sv: Ljus

source: High Contrast
fr: Contraste élevé
hu: Magas kontraszt
ja: ハイコントラスト
pt_br: Alto Contraste
sv: Hög kontrast

source: Aqua Chill
ja: アクア・チル
sv: Lugnt vatten

source: UI Theme
fr: Thème d'interface
hu: UI téma
ja: UIテーマ
pt_br: Tema da Interface
sv: Tema för grafiskt gränssnitt

source: Select the UI color theme.
fr: Sélectionner le thème d'interface utilisateur.
ja: UIのカラーテーマを選択します。
pt_br: Selecione a cor da Interface do usuário.
sv: Välj färgtema för grafiskt gränssnitt.

source: Hide Legacy Naomi Roms
fr: Masquer les anciennes Roms Naomi
hu: Legacy Naomi ROM-ok elrejtése
ja: レガシーなNaomiロムを非表示
pt_br: Esconder Roms Legadas da Naomi
sv: Dölj föråldrade Naomi-roms

source: Hide .bin, .dat and .lst files from the content browser
fr: Cache les fichiers .bin, .dat et .lst de la liste de jeu
hu: A .bin, .dat és .lst fájlok elrejtése a tartalom böngészőből
ja: コンテンツブラウザから.bin、.dat、.lstファイルを非表示にする
pt_br: Ocultar arquivos .bin, dat e lst do navegador de conteúdo.
sv: Dölj .bin, .dat och .lst-filer från innehållsbläddraren

source: Use SAF File Picker
fr: Utiliser le sélecteur de fichiers SAF
hu: SAF fájlválasztó használata
ja: SAFファイルピッカーを使用
pt_br: Usar Seletor de Arquivos SAF
sv: Använd SAF-filväljare

source: Use Android Storage Access Framework file picker to select folders and files. Ignored on Android 10 and later.
fr: Utilise le sélecteur de fichiers Android Storage Access Framework pour sélectionner dossiers et fichiers. Ignoré sur Android 10 et ultérieur.
hu: Az Android Storage Access Framework fájlválasztóját használja a mappák és fájlok kiválasztásához. Android 10 és újabb verziókban figyelmen kívül hagyva.
ja: Android Storage Access Framework ファイルピッカーを使用してフォルダとファイルを選択します。Android 10以降では無視されます。
pt_br: Usar o seletor de arquivos de acesso ao armazenamento do Android para selecionar pastas e arquivos. Ignorado no Android 10 ou posterior.
sv: Använd Android Storage Access Framework-filväljaren för att välja mappar och filer. Ignoreras i Android 10 och senare.

source: Automatic State:
fr: État automatique :
hu: Automatikus állapot:
ja: 自動ステート：
pt_br: Estado Automático:
sv: Automatiskt tillstånd:

source: Load
fr: Charger
hu: Betöltés
ja: ロード
pt_br: Carregar
sv: Läs in

source: Load the last saved state of the game when starting
fr: Charge le dernier état sauvegardé au démarrage
hu: A játék indításakor betölti a legutóbb mentett állapotot
ja: ゲームの起動時に最後に保存したステートを読み込みます
pt_br: Carregar o último estado salvo do jogo quando iniciar
sv: Läs in senast sparade tillstånd för spelet vid start

source: Save
fr: Sauver
hu: Mentés
ja: セーブ
pt_br: Salvar
sv: Spara

source: Save the state of the game when stopping
fr: Sauvegarde l'état du jeu avant d'arrêter
hu: Játékállapot mentése leállításkor
ja: ゲームを停止するときにステートを保存する
pt_br: Salvar o estado do jogo quando parar
sv: Spara tillståndet för spelet vid stopp

source: Naomi Free Play
fr: Gratuité Naomi
hu: Naomi Ingyenes játék
ja: Naomiフリープレイ
pt_br: Jogar Naomi no modo sem fichas

source: Configure Naomi games in Free Play mode.
fr: Configure les jeux Naomi pour être en accès libre.
hu: Beállítja a Naomi játékokat szabad játék módba.
ja: Naomiゲームをフリープレイモードに設定します。
pt_br: Configure os jogos Naomi no modo sem fichas.
sv: Konfigurera Naomi-spel i Free Play-läge.

source: Discord Presence
fr: Présence Discord
hu: Discord jelenlét
ja: Discordプレゼンス
pt_br: Presença no Discord
sv: Discord-närvaro

source: Show which game you are playing on Discord
fr: Affiche à quel jeu vous jouez sur Discord
hu: Mutatja Discordon, melyik játékot játszod
ja: Discordでプレイ中のゲームを表示する
pt_br: Mostra qual jogo você está jogando no Discord
sv: Visa vilket spel du spelar på Discord

source: Enable RetroAchievements
fr: Activer les Succès
hu: RetroAchievements engedélyezése
ja: レトロアチーブメントを有効にする
pt_br: Habilitar Retro-Conquistas
sv: Aktivera RetroAchievements

source: Track your game achievements using RetroAchievements.org
fr: Suivez vos succès de jeu avec RetroAchievements.org
hu: Nyomon követi a játékbeli eredményeket a RetroAchievements.org segítségével
ja: RetroAchievements.orgを使用してゲームの実績を追跡する
pt_br: Acompanhe as conquistas do seu jogo usando RetroAchievements.org
sv: Spåra dina spelprestationer med RetroAchievements.org

source: Enable RetroAchievements hardcore mode. Using cheats and loading a state are not allowed in this mode.
fr: Active le mode Hardcore des succès. L'utilisation des codes de triche et le chargement d'un état sont désactivés dans ce mode.
hu: Engedélyezi a RetroAchievements hardcore módot. Ebben a módban nem engedélyezett a csalás és az állapot betöltés.
ja: レトロアチーブメントのハードコアモードを有効にします。このモードではチートの使用やステートの読み込みは許可されません。
pt_br: Ativar modo hardcore de Retro-Conquistas. Neste modo, não é permitido usar trapaças nem carregar estado salvo.
sv: Aktivera ReroAchievements hardcore-läge. Användning av fusk och läsa in tillstånd är inte tillåtna i detta läge.

source: Username
fr: Nom utilisateur
hu: Felhasználónév
ja: ユーザー名
pt_br: Nome de usuário
sv: Användarnamn

source: Authentication successful
fr: Authentifié avec succès
hu: Sikeres hitelesítés
ja: 認証成功
pt_br: Autenticação bem-sucedida
sv: Autentisering lyckades

source: Logout
fr: Déconnexion
hu: Kijelentkezés
ja: ログアウト
pt_br: Sair
sv: Logga ut

source: Password
fr: Mot de passe
hu: Jelszó
ja: パスワード
pt_br: Senha
sv: Lösenord

source: Authenticating...
fr: Authentification...
hu: Hitelesítés...
ja: 認証中…
pt_br: Autenticando...
sv: Autentiserar...

source: Login
fr: Connexion
hu: Bejelentkezés
ja: ログイン
pt_br: Entrar
sv: Logga in

source: Custom Paths
fr: Chemins de Fichier Personnalisés
hu: Egyedi útvonalak
ja: カスタムパス
pt_br: Paths Personalizados
sv: Anpassade sökvägar

source: BIOS Folders
fr: Dossiers de BIOS
hu: BIOS mappák
ja: BIOSフォルダー
pt_br: Pastas da BIOS
sv: BIOS-mappar

source: Select a BIOS folder
fr: Sélectionner un dossier de BIOS
hu: BIOS mappa kiválasztása
ja: BIOSフォルダーを選択
pt_br: Selecione uma pasta BIOS
sv: Välj en BIOS-mapp

source: Folders containing BIOS files (e.g. dc_boot.bin or dc_bios.bin) and arcade BIOS
fr: Dossiers contenant les fichiers BIOS (dc_boot.bin ou dc_bios.bin) et les BIOS arcade
hu: A BIOS fájlokat (pl. dc_boot.bin vagy dc_bios.bin) és az arcade BIOS-t tartalmazó mappák
ja: BIOSファイル(例：dc_boot.bin、dc_bios.bin)とアーケードBIOSを含むフォルダー
pt_br: Pastas que contêm arquivos BIOS (por exemplo, dc_boot.bin ou dc_bios.bin) e BIOS de arcade
sv: Mappar som innehåller BIOS-filer (t.ex. dc_boot.bin eller dc_bios.bin) och arcade BIOS

source: VMU Folder
fr: Dossier VMU
hu: VMU mappa
ja: VMUフォルダー
pt_br: Pasta do VMU
sv: VMU-mapp

source: Select the VMU folder
fr: Sélectionner le dossier VMU
hu: Válassza ki a VMU mappát
ja: VMUフォルダーを選択する
pt_br: Selecionar pasta do VMU
sv: Välj VMU-mappen

source: Folder where VMU (.bin) saves are stored
fr: Dossier où les sauvegardes VMU (.bin) sont stockées
hu: A VMU (.bin) mentések tárolási helye
ja: VMU (.bin) が保存されているフォルダー
pt_br: Pasta onde os saves do VMU (.bin) são armazenados
sv: Mapp där VMU (.bin) sparningar lagras

source: Savestate Folders
fr: Dossiers états
ja: セーブステートフォルダー
pt_br: Pastas de Save State
sv: Mappar för sparade tillstånd

source: Select a savestate folder
fr: Sélectionner un dossier états
ja: セーブステートフォルダーを選択
pt_br: Selecionar uma pasta de save state
sv: Välj en mapp för sparade tillstånd

source: Folders for save states. First path is used for new states; all are searched when loading
fr: Dossiers pour les sauvegardes d'état. Le premier chemin est utilisé pour stocker les états ; tous sont parcourus lors du chargement
ja: セーブステート用のフォルダー。最初のパスは新しいステートに使用され、読み込み時にすべてのパスが検索されます
pt_br: Pastas para estados salvos. O primeiro caminho é usado para novos estados; todas são pesquisadas ao carregar
sv: Mappar för sparade tillstånd. Första sökvägen används för nya tillstånd; alla söks igenom vid inläsning

source: Game Save Folder
fr: Dossier Sauvegarde Jeu
hu: Játék mentési mappa
ja: ゲームセーブフォルダー
pt_br: Pasta de Save do Jogo
sv: Mapp för sparade spel

source: Select the game save folder
fr: Sélectionner le dossier de sauvegarde jeu
hu: Válassza ki a játék mentési mappáját
ja: ゲームのセーブフォルダーを選択
pt_br: Selecionar a pasta para salvar o jogo
sv: Välj mappen för sparade spel

source: Folder for game save data (e.g. arcade NVRAM)
fr: Dossier pour les sauvegardes de jeu (NVRAM arcade)
hu: Mappa a játék mentési adataihoz (pl. arcade NVRAM)
ja: ゲームのセーブデータ用のフォルダー(例：アーケードNVRAM)
pt_br: Pasta para dados de jogo salvo (ex. arcade NVRAM)
sv: Mapp för sparat data för spel (t.ex. arcade NVRAM)

source: Texture Pack Folders
fr: Dossiers Textures Personnalisées
hu: Textúra csomag mappák
ja: テクスチャ パックフォルダー
pt_br: Pastas de Pacotes de Texturas
sv: Mappar för texturpaket

source: Select a texture pack folder
fr: Sélectionner un dossier de textures personnalisées
hu: Válasszon ki egy textúracsomag mappát
ja: テクスチャパックフォルダーを選択
pt_br: Selecionar uma pasta de pacote de textura
sv: Välj mapp för texturpaket

source: Folders containing textures/<gameId> or <gameId> under a textures subfolder
fr: Dossiers contenant des dossiers 'textures/<id jeu>' or '<id jeu>'
ja: textures/<gameId> または <gameId> の下にあるサブフォルダーを含むテクスチャフォルダー
pt_br: Pastas contendo texturas/<gameId> ou <gameId> sob uma subpasta de texturas
sv: Mappar som innehåller textures/<gameId> eller <gameId> under en undermapp med namnet textures

source: Texture Dump Folder
fr: Dossier Sauvegarde Textures
ja: テクスチャダンプフォルダー
pt_br: Pasta de Descarga de Textura
sv: Mapp för texturdumpning

source: Select the texture dump folder
fr: Sélectionner le dossier de sauvegarde des textures
ja: テクスチャダンプフォルダーを選択
pt_br: Selecionar pasta de despejo de texturas
sv: Välj mappen för texturdumpning

source: Folder where texture dumps are saved. Game-specific subfolders will be created automatically
fr: Dossier où sont sauvegardées les textures. Des sous-dossiers pour chaque jeu seront créés automatiquement
ja: テクスチャダンプが保存されるフォルダー。ゲーム固有のサブフォルダーは自動的に作成されます
pt_br: Pasta onde os despejos de texturas são salvos. As subpastas específicas dos jogos serão criadas automaticamente
sv: Mapp där texturdumpningar sparas. Spelspecifika undermappar skapas automatiskt

source: Box Art Folder
fr: Dossier Couvertures Jeux
hu: Borító mappa
ja: ボックスアートフォルダー
pt_br: Pasta de Capas
sv: Mapp för omslagsbilder

source: Select the box art folder
fr: Select le dossier pour les couvertures des jeux
hu: Válassza ki a borító mappát
ja: ボックスアートフォルダーを選択
pt_br: Selecionar pasta de Capas
sv: Välj mappen för omslagsbilder

source: Folder containing box art images (png/jpg). If empty, Flycast will use the default Home Folder/boxart for downloads and generated art
fr: Dossier contenant les images de couverture (png, jpg). Si non spécifié, Flycast utilisera un dossier par défaut
hu: A borító képeket (png/jpg) tartalmazó mappa. Ha üres, a Flycast az alapértelmezett Saját mappát/borítót használja a letöltésekhez és a generált képekhez
ja: ボックスアート画像(png/jpg)を含むフォルダー。空白の場合、Flycastはダウンロードと生成されたアートに対してデフォルトのホームフォルダー (data/boxart) を使用します
pt_br: Pasta que contém imagens de capa (png/jpg). Se estiver vazia, o Flycast usará a pasta padrão Home Folder/boxart para downloads e capas geradas
sv: Mapp som innehåller omslagsbilder (png/jpg). Om den är tom kommer Flycast att använda standardiserad hemmapp/boxart för hämtningar och genererade omslag

source: Controller Mapping Folders
fr: Dossier Configuration Contrôleurs
ja: コントローラーマッピングフォルダー
pt_br: Pasta de Mapeamento de Controles
sv: Mappar för kontrollermappning

source: Select a controller mapping folder
fr: Sélectionner un dossier de configuration contrôleurs
ja: コントローラーマッピングフォルダーを選択
pt_br: Selecionar Pasta de Mapeamento de Controles
sv: Välj en mapp för kontrollermappning

source: Folders containing controller mapping files (.cfg). The emulator also looks in Home Folder/mappings. Per-game mappings are suffixed with _<gameId>.cfg
fr: Dossiers contenant les fichiers de configuration des contrôleurs (.cfg). Flycast recherche aussi dans Dossier Principal/mappings. Les configurations spécifiques à un jeu utilisent le suffixe '_<id jeu>.cfg'
ja: コントローラーのマッピングファイル (.cfg)を含むフォルダー. エミュレーターはホームフォルダー/mappingsも参照します. ゲーム毎のマッピングは _<gameId>.cfg でサフィックスされます
pt_br: Pastas contendo arquivos de mapeamento de controle (.cfg). O emulador também procura em Home Folder/mappings. Mapeamentos por jogos usam o sufixo _<gameId>.cfg
sv: Mappar som innehåller mappningsfiler (.cfg) för kontroller. Emulatorn letar också i hemmapp/mappings. Per-spelsmapparna har suffixet _<gameId>.cfg

source: Cheat Folders
fr: Dossiers Triches
hu: Csalás mappák
ja: チートフォルダー
pt_br: Pastas de trapaças
sv: Mappar för fusk

source: Select a cheat folder
fr: Sélectionner un dossier de fichiers de triche
hu: Válasszon ki egy csalás mappát
ja: チートフォルダーを選択
pt_br: Selecionar uma pasta trapaça
sv: Välj en mapp för fusk

source: Folders containing cheat files (.cht/.txt) named with the game ID. Flycast will auto-load matching files if present
fr: Dossiers contenant les fichiers de triche (.cht/.txt) nommés avec l'identifiant jeu. Flycast charge automatiquement le fichier correspondant au jeu actif
hu: A játék azonosítójával elnevezett csaló fájlokat (.cht/.txt) tartalmazó mappák. A Flycast automatikusan betölti a megfelelő fájlokat, ha azok léteznek
ja: チートファイル(.cht/.txt)を含むフォルダーにはゲームIDが指定されています。Flycastはマッチするファイルを自動的にロードします
pt_br: Pastas que contêm arquivos de trapaça (.cht/.txt) nomeadas com o ID do jogo. Flycast carregará automaticamente arquivos correspondentes se estiver presente
sv: Mappar som innehåller fuskfiler (.cht/.txt) namngivna med spel-ID. Flycast kommer automatiskt läsa in matchande filer om de finns

source: Dreamcast BIOS
fr: BIOS Dreamcast
ja: ドリームキャストBIOS
pt_br: Bios do Dreamcast

source: None
fr: Aucun
hu: Nincs
ja: なし
pt_br: Nenhum
sv: Ingen

source: Sega Controller
fr: Manette Sega
hu: Sega vezérlő
ja: セガコントローラー
pt_br: Controle Sega

source: Light Gun
fr: Pistolet optique
hu: Fénypisztoly
ja: ライトガン
pt_br: Pistola de luz
sv: Ljuspistol

source: Keyboard
fr: Clavier
hu: Billentyűzet
ja: キーボード
pt_br: Teclado
sv: Tangentbord

source: Mouse
fr: Souris
hu: Egér
ja: マウス
sv: Mus

source: Twin Stick
ja: ツインスティック
pt_br: Controle de Alavanca Dupla

source: Arcade/Ascii Stick
fr: Console Arcade/Ascii Stick
ja: アーケード / アスキースティック
pt_br: Controle de Arcade/Ascii
sv: Arkad/Ascii Stick

source: Maracas Controller
fr: Contrôleur Maracas
hu: Maracas vezérlő
ja: マラカスコントローラー
pt_br: Controle Marcas
sv: Maracas-kontroller

source: Fishing Controller
fr: Contrôleur Canne à Pêche
ja: 釣りコントローラー
pt_br: Controle de Pesca
sv: Fishing-kontroller

source: Pop'n Music controller
fr: Contrôleur Pop'n Music
ja: ポップンミュージックコントローラー
pt_br: Controle de música Pop'n
sv: Pop'n Music-kontroller

source: Racing Controller
fr: Volant de Course
ja: レーシングコントローラー
pt_br: Controle de Corrida
sv: Racing-kontroller

source: Densha de Go! Controller
fr: Contrôleur Densha de Go!
ja: 電車でGO!コントローラー
pt_br: Controle Densha de Go
sv: Densha de Go!-kontroller

source: Panther DC/Full Controller
fr: Contrôleur Panther DC/complet
ja: Panther DC/フルコントローラー
pt_br: Controle Panther DC
sv: Panther DC/Full kontroller

source: Vibration Pack
fr: Vibreur
hu: Rezgő csomag
ja: ぷるぷるぱっく
pt_br: Pacote de Vibração
sv: Vibrationspack

source: Microphone
hu: Mikrofon
ja: マイク
pt_br: Microfone
sv: Mikrofon

source: All
fr: Tous
hu: Összes
ja: 全て
pt_br: Todos
sv: Alla

source: Directions
hu: Irány
ja: 方向
pt_br: Direção
sv: Riktningar

source: Up
fr: Haut
hu: Fel
ja: 上
pt_br: Cima
sv: Upp

source: Down
fr: Bas
hu: Le
ja: 下
pt_br: Baixo
sv: Ner

source: Left
fr: Gauche
hu: Balra
ja: 左
pt_br: Esquerda
sv: Vänster

source: Right
fr: Droite
hu: Jobbra
ja: 右
pt_br: Direita
sv: Höger

source: Thumbstick Up
fr: Stick Haut
ja: アナログスティック上
pt_br: Analógico Cima
sv: Tumspak upp

source: Thumbstick Down
fr: Stick Bas
ja: アナログスティック下
pt_br: Analógico Baixo
sv: Tumspak ner

source: Thumbstick Left
fr: Stick Gauche
ja: アナログスティック左
pt_br: Analógico Esquerda
sv: Tumspak vänster

source: Thumbstick Right
fr: Stick Droite
ja: アナログスティック右
pt_br: Analógico Direita
sv: Tumspak höger

source: R.Thumbstick Up
fr: Stick Droit Haut
ja: 右アナログスティック上
pt_br: Analógico Direito Cima
sv: H. tumspak upp

source: R.Thumbstick Down
fr: Stick Droit Bas
ja: 右アナログスティック下
pt_br: Analógico Direito Baixo
sv: H. tumspak ner

source: R.Thumbstick Left
fr: Stick Droit Gauche
ja: 右アナログスティック左
pt_br: Analógico Direito Esquerda
sv: H. tumspak vänster

source: R.Thumbstick Right
fr: Stick Droit Droite
ja: 右アナログスティック右
pt_br: Analógico Direito Direita
sv: H. tumspak höger

source: Axis 3 Up
fr: Axe 3 Haut
ja: Axis 3 上
pt_br: Eixo 3 Cima
sv: Axel 3 upp

source: Axis 3 Down
fr: Axe 3 Bas
ja: Axis 3 下
pt_br: Eixo 3 Baixo
sv: Axel 3 ner

source: Axis 3 Left
fr: Axe 3 Gauche
ja: Axis 3 左
pt_br: Eixo 3 Esquerda
sv: Axel 3 vänster

source: Axis 3 Right
fr: Axe 3 Droite
ja: Axis 3 右
pt_br: Eixo 3 Direita
sv: Axel 3 höger

source: Buttons
fr: Boutons
hu: Gombok
ja: ボタン
pt_br: Botões
sv: Knappar

source: Triggers
fr: Gâchettes
hu: Ravaszok
ja: トリガー
pt_br: Gatilhos
sv: Avtryckare

source: Left Trigger
fr: Gâchette Gauche
hu: Bal ravasz
ja: 左トリガー
pt_br: Gatilho Esquerdo
sv: Vänster avtryckare

source: Right Trigger
fr: Gâchette Droite
hu: Jobb ravasz
ja: 右トリガー
pt_br: Gatilho Direito
sv: Höger avtryckare
