Repository: flyinghead/flycast
Catalog: resources/i18n/*.po
Languages: fr, hu, ja, pt_br, sv

source: Left Trigger 2
fr: Gâchette 2 Gauche
hu: Bal ravasz 2
ja: 左トリガー2
pt_br: Gatilho Esquerdo 2
sv: Vänster avtryckare 2

source: Right Trigger 2
fr: Gâchette 2 Droite
hu: Jobb ravasz 2
ja: 右トリガー2
pt_br: Gatilho Direito 2
sv: Höger avtryckare 2

source: System Buttons
fr: Boutons Système
hu: Rendszer billentyűk
ja: システム ボタン
pt_br: Botões do Sistema
sv: Systemknappar

source: Reload
fr: Recharger
hu: Újratöltés
ja: リロード
pt_br: Recarregar
sv: Läs om

source: Emulator
fr: Émulateur
hu: Emulátor
ja: エミュレーター
pt_br: Emulador

source: Menu
hu: Menü
ja: メニュー
sv: Meny

source: Exit
fr: Quitter
hu: Kilépés
ja: 終了
pt_br: Sair
sv: Avsluta

source: Fast-forward
fr: Avance Rapide
hu: Gyors-előrepörgetés
ja: 早送り
pt_br: Adiantar
sv: Snabbspola

source: Load State
fr: Charger État
hu: Mentett állapot betöltése
ja: ロードステート
pt_br: Carregador Estado
sv: Läs in tillstånd

source: Save State
fr: Sauver État
hu: Állapot mentése
ja: セーブステート
pt_br: Salvar Estado
sv: Spara tillstånd

source: Bypass Emulated Keyboard
fr: Désactiver Clavier Émulé
ja: エミュレートされたキーボードをバイパス
pt_br: Ignorar Teclado Emulado
sv: Kringgå emulerat tangentbord

source: Save Screenshot
fr: Capture d'écran
hu: Képernyőkép mentése
ja: スクリーンショットを保存
pt_br: Salvar Captura de Tela
sv: Spara skärmbild

source: Button 1
fr: Bouton 1
hu: Gomb 1
ja: ボタン 1
pt_br: Botão 1
sv: Knapp 1

source: Button 2
fr: Bouton 2
hu: Gomb 2
ja: ボタン 2
pt_br: Botão 2
sv: Knapp 2

source: Button 3
fr: Bouton 3
hu: Gomb 3
ja: ボタン 3
pt_br: Botão 3
sv: Knapp 3

source: Button 4
fr: Bouton 4
hu: Gomb 4
ja: ボタン 4
pt_br: Botão 4
sv: Knapp 4

source: Button 5
fr: Bouton 5
hu: Gomb 5
ja: ボタン 5
pt_br: Botão 5
sv: Knapp 5

source: Button 6
fr: Bouton 6
hu: Gomb 6
ja: ボタン 6
pt_br: Botão 6
sv: Knapp 6

source: Button 7
fr: Bouton 7
hu: Gomb 7
ja: ボタン 7
pt_br: Botão 7
sv: Knapp 7

source: Button 8
fr: Bouton 8
hu: Gomb 8
ja: ボタン 8
pt_br: Botão 8
sv: Knapp 8

source: Coin
fr: Pièce
ja: コイン
pt_br: Ficha
sv: Mynt

source: Service
hu: Szolgáltatás
ja: サービス
pt_br: Serviço

source: Test
hu: Teszt
ja: テスト
pt_br: Teste
sv: Testa

source: Insert Card
fr: Insérer Carte
ja: カードを挿入
pt_br: Inserir Cartão
sv: Infoga kort

source: Map Control
fr: Liaison Contrôle
ja: マップコントロール
pt_br: Controle de Mapeamento
sv: Mappa kontroll

source: Waiting for control '%s'...
fr: En attente du contrôle '%s'...
ja: '%s' の入力待ち…
pt_br: Esperando por Controle '%s'...
sv: Väntar på kontroller '%s'...

source: Time out in %d s
fr: Arrêt dans %d s
ja: %d 秒でタイムアウト
pt_br: Tempo esgotado em %d s
sv: Tidsgräns om %d s

source: Current inputs:
fr: Entrées actuelles :
ja: 現在の入力：
pt_br: Entradas atuais:
sv: Aktuella inmatningar:

source: Confirm
fr: Confirmer
hu: Megerősítés
ja: 確認
pt_br: Confirmar
sv: Bekräfta

source: Sequential
fr: Séquentiel
ja: 順次入力
pt_br: Sequencial
sv: Sekventiell

source: When checked, this combo will only activate when all keys are pressed in the given sequence. When not checked, the combo will activate when all keys are pressed in any order.
fr: Si activé, cette combinaison est activée lorsque les boutons sont pressés dans le même ordre. Si désactivé, cette combinaison est activée lorsque tous les boutons sont pressés quelque soit l'ordre.
ja: チェックを入れると、このコンボはすべてのキーが指定された順序で押された場合にのみ有効になります。 チェックを入れないと、すべてのキーが任意の順序で押されたときにコンボが起動します。
pt_br: Quando marcado, este combo só será ativado quando todas as teclas forem pressionadas na sequência indicada. Quando não selecionado, a combinação será ativada quando todas as teclas forem pressionadas em qualquer ordem.
sv: När detta markeras aktiveras endast när alla tangenter trycks in i den angivna sekvensen. När den inte är markerad så aktiveras kombinationen när alla tangenter trycks in i valfri ordning.

source: Controller Mapping
fr: Liaisons Contrôleur
ja: コントローラーマッピング
pt_br: Mapeamento de Controle
sv: Kontrollermappning

source: Map
fr: Lier
hu: Térkép
ja: 割り当て
pt_br: Mapa
sv: Mappa

source: Unmap
fr: Délier
ja: 解除
pt_br: Anular Mapeamento
sv: Avmappa

source: Done
fr: Fermer
hu: Rendben
ja: 完了
pt_br: Feito
sv: Klar

source: Port
ja: ポート
pt_br: Porta

source: Dreamcast Controls
fr: Contrôles Dreamcast
ja: Dreamcastコントロール
pt_br: Controles de Dreamcast
sv: Dreamcast-kontroller

source: Delete Game Config
fr: Supprimer config jeu
ja: ゲーム設定を削除
pt_br: Excluir configuração do jogo
sv: Ta bort spelkonfig

source: Make Game Config
fr: Créer config jeu
ja: ゲーム設定の作成
pt_br: Criar Configuração de Jogo
sv: Skapa spelkonfig

source: Reset...
fr: Réinitialiser...
hu: Alapállapot...
ja: リセット…
pt_br: Reiniciar...
sv: Återställ...

source: Confirm Reset
fr: Confirmer la réinitialisation
ja: リセットを確認
pt_br: Confirmar reinício
sv: Bekräfta återställning

source: Are you sure you want to reset the mappings to default?
fr: Êtes-vous sûr de vouloir réinitialiser les liaisons par défaut ?
ja: マッピングをデフォルトにリセットしてもよろしいですか？
pt_br: Tem certeza que deseja redefinir os mapeamentos para o padrão?
sv: Är du säker på att du vill återställa mappningarna till standard?

source: Controller Type:
fr: Type de contrôleur :
hu: Játékvezérlő típusa:
ja: コントローラーの種類：
pt_br: APAGAR Controle:
sv: Kontrollertyp:

source: Gamepad
fr: Manette
ja: ゲームパッド

source: Arcade / Hit Box
fr: Console Arcade
ja: アーケード/ヒットボックス
pt_br: Caixa de Arvade
sv: Arkad / Hit Box

source: Yes
fr: Oui
hu: Igen
ja: はい
pt_br: Sim
sv: Ja

source: No
fr: Non
hu: Nem
ja: いいえ
pt_br: Não
sv: Nej

source: Arcade Controls
fr: Contrôles Arcade
hu: Arcade vezérlők
ja: アーケードコントロール
pt_br: Controles de Arcade
sv: Arkadkontroller

source: Gamepad Settings
fr: Préférences Manette
hu: Gamepad beállítások
ja: ゲームパッドの設定
pt_br: Configuração do Gamepad
sv: Inställningar för gamepad

source: Haptic
fr: Haptique
hu: Haptikus
ja: ハプティック
pt_br: Resposta Tátil
sv: Haptisk

source: Power
fr: Puissance
ja: 強さ
pt_br: Ligar
sv: Styrka

source: Haptic feedback power
fr: Puissance Haptique
ja: ハプティックフィードバックの強さ
pt_br: Potencia da Resposta Tátil
sv: Styrka för haptisk feedback

source: View
fr: Vue
hu: Nézet
ja: ビュー
pt_br: Exibir
sv: Visning

source: Transparency
fr: Transparence
hu: Átlátszóság
ja: 透明度
pt_br: Transparência
sv: Transparens

source: Virtual gamepad buttons transparency
fr: Transparence des boutons de la manette virtuelle
ja: 仮想ゲームパッドボタンの透明度
pt_br: Transparência dos botões do gamepad virtual
sv: Knapptransparens för virtuell gamepad

source: Select a PNG file
fr: Sélectionner une image PNG
hu: Válasszon ki egy PNG fájlt
ja: PNGファイルを選択
pt_br: Selecionar um arquivo PNG
sv: Välj en PNG-fil

source: Choose Image...
fr: Choisir une image...
hu: Kép kiválasztása...
ja: 画像を選択…
pt_br: Escolher imagem...
sv: Välj bild...

source: Use Default
fr: Image Standard
hu: Alapértelmezés használata
ja: デフォルトを使用
pt_br: Usar padrão
sv: Använd standard

source: Rumble
fr: Vibration
hu: Rezgő
ja: 振動
pt_br: Vibrar

source: Rumble power
fr: Puissance de vibration
ja: 振動の強さ
pt_br: Potência da Vibração
sv: Rumble-kraft

source: Thumbsticks
fr: Sticks Analogiques
ja: アナログスティック
pt_br: Analógicos
sv: Tumspakar

source: Dead zone
fr: Zone morte
hu: Holtzóna
ja: デッドゾーン
pt_br: Zona inativa
sv: Dödzon

source: Minimum deflection to register as input
fr: Amplitude minimum détectée par le jeu
ja: 入力として反応し始める最小の倒し込み量
pt_br: Desvio mínimo para registrar como entrada
sv: Minsta spakrörelse för att registreras som inmatning

source: Saturation
ja: 最大しきい値
pt_br: Saturação
sv: Mättnad

source: Value sent to the game at 100% thumbstick deflection. Values greater than 100% will saturate before full deflection of the thumbstick.
fr: Valeur envoyée au jeu pour une amplitude de 100% du stick analogique. Les valeurs supérieures à 100% atteindront la saturation avant l'amplitude maximum du stick.
ja: スティックを100%まで倒した時にゲームへ送られる入力値です。100%を超える設定にすると、スティックを最後まで倒し切る前に入力が飽和の状態になります。
pt_br: Valor enviado ao jogo com o analógico 100% inclinado. Valores acima de 100% saturam antes de o analógico atingir o fim do curso.
sv: Värde som skickas till spelet vid 100% spakrörelse med tumspak. Värden över 100% mättas innan tumspaken är helt flyttad.

source: Physical Devices
fr: Périphériques Physiques
hu: Fizikai eszközök
ja: 物理デバイス
pt_br: Dispositivos Físicos
sv: Fysiska enheter

source: System
fr: Système
hu: Rendszer
ja: システム
pt_br: Sistema

source: Name
fr: Nom
hu: Név
ja: 名前
pt_br: Nome
sv: Namn

source: DreamLink status: %s
fr: Statut DreamLink : %s
hu: DreamLink állapot: %s
ja: DreamLinkステータス: %s

source: Edit Layout
fr: Éditer le Plan
hu: Elrendezés szerkesztése
ja: レイアウトを編集
pt_br: Editar Layout
sv: Redigera layout

source: Settings
fr: Préférences
hu: Beállítások
ja: 設定
pt_br: Configurações
sv: Inställningar

source: Mouse sensitivity
fr: Sensibilité de la souris
hu: Egér érzékenysége
ja: マウス感度
pt_br: Sensibilidade do mouse
sv: Muskänslighet

source: Use Raw Input
fr: Utiliser Raw Input
ja: Raw入力を使用
pt_br: Usar Entrada Raw
sv: Använd rå inmatning

source: Supports multiple pointing devices (mice, light guns) and keyboards
fr: Supporte plusieurs périphériques de pointage (souris, pistolets optiques) et claviers
ja: 複数のポインティングデバイス(マウス、ライトガン)とキーボードをサポート
pt_br: Suporta vários dispositivos de apontamento (microfone, armas de luz) e teclados
sv: Stöder flera pekenheter (möss, ljuspistoler) och tangentbord

source: Use Physical VMU Memory
fr: Utiliser la mémoire VMU physique
ja: 物理VMUメモリを使用
pt_br: Usar VMU Físico
sv: Använd fysiskt VMU-minne

source: Enables direct read/write access to physical VMU memory via DreamPicoPort/DreamConn. This is not compatible with load state events.
fr: Active la lecture/écriture directe à la mémoire du VMU via DreamPicoPort/DreamConn. Incompatible avec le chargement d'états.
ja: DreamPicoPort/DreamConnを介して物理VMUメモリへの直接読み込み/書き込みアクセスを有効にします。これはロードステートイベントと互換性がありません。
pt_br: Permite o acesso direto de leitura/gravação à memória física VMU via DreamPicoPort/DreamConn. Isso não é compatível em carregar estados salvos.
sv: Möjliggör direkt läs-/skrivåtkomst till fysiskt VMU-minne via DreamPicoPort/DreamConn. Detta är inte kompatibelt med händelser vid inläsning av tillstånd.

source: Dreamcast Devices
fr: Périphériques Dreamcast
hu: Dreamcast eszközök
ja: Dreamcastデバイス
pt_br: Dispositivos Dreamcast
sv: Dreamcast-enheter

source: Port %c
ja: ポート %c
pt_br: Porta %c

source: Crosshair color
fr: Couleur du réticule
hu: Célkereszt színe
ja: 十字線の色
pt_br: Cor da mira
sv: Hårkorsets färg

source: Crosshair
fr: Réticule
hu: Célkereszt
ja: 十字線
pt_br: Mira
sv: Hårkors

source: Use Network Expansion Devices
fr: Utiliser les périphériques étendus réseau
ja: ネットワーク拡張デバイスを使用
pt_br: Usar dispositivos de expansão de rede
sv: Använd Network Expansion-enheter

source: Connect to expansion devices such as VMUs over local TCP.
fr: Connecter à des périphériques étendus comme des VMUs réseau.
ja: ローカルTCP経由でVMUなどの拡張デバイスに接続します。
pt_br: Conectar a dispositivos de expansão, como VMUs, via TCP local.
sv: Anslut till expansionsenheter så som VMUer över lokal TCP.

source: Crosshair Size
fr: Taille Réticule
hu: Célkereszt mérete
ja: 十字線のサイズ
pt_br: Tamanho da Mira
sv: Storlek på hårkorset

source: Per Game VMU A1
fr: VMU A1 par jeu
ja: ゲームごとのVMU A1
pt_br: Por jogo VMU A1
sv: VMU A1 per spel

source: When enabled, each game has its own VMU on port 1 of controller A.
fr: Si activé, chaque jeu à son propre VMU sur le port 1 du contrôleur A.
ja: 有効にすると、各ゲームはコントローラーAのポート1に独自のVMUを持つようになります。
pt_br: Quando ativado, cada jogo tem sua própria VMU na porta 1 do controle A.
sv: När aktiverad har varje spel sin egna VMU på port 1 för kontroller A.

source: Close
fr: Fermer
hu: Bezár
ja: 閉じる
pt_br: Fechar
sv: Stäng

source: You have unlocked %d of %d achievements and %d of %d points.
fr: Vous avez débloqué %d succès sur %d et %d points sur %d.
ja: あなたは %d / %d の実績と %d / %d ポイントを解除しました。
pt_br: Você desbloqueou %d conquistas das %d e %d pontos dos %d.
sv: Du har låst upp %d av %d prestationer och %d av %d poäng.

source: Locked
fr: Bloqué
hu: Zárolt
ja: ロックされています
pt_br: Bloqueado
sv: Låst

source: Active Challenges
fr: Challenges Actifs
hu: Aktív kihívások
ja: アクティブチャレンジ
pt_br: Desafios Ativos
sv: Aktiva utmaningar

source: Almost There
fr: On y est presque
ja: あと少しです
pt_br: Quase lá
sv: Nästan där

source: Unlocked
fr: Débloqué
hu: Feloldva
ja: 解除
pt_br: Desbloqueado
sv: Upplåst

source: Recently Unlocked
fr: Débloqué récemment
hu: Nemrég feloldott
ja: 最近解除されたもの
pt_br: Desbloqueado recentemente
sv: Senaste upplåsta

source: Renderer initialization failed. Please select a different graphics API
fr: L'initialisation du moteur de rendu a échoué. Veuillez sélectionner une API graphique différente
ja: レンダラーの初期化に失敗しました。 別のグラフィックAPIを選択してください
pt_br: Inicialização de renderização falhou. Por favor, selecione uma API gráfica diferente
sv: Initiering av renderaren misslyckades. Välj ett annat grafik-API

source: Flycast has stopped.
fr: Flycast a stoppé.
hu: A Flycast leállt.
ja: Flycast は停止しました。
pt_br: Flycast parou.
sv: Flycast har stoppat.

source: Resume
fr: Continuer
hu: Folytatás
ja: 再開
pt_br: Continuar
sv: Återuppta

source: Cheats
fr: Codes de triche
hu: Csalások
ja: チート
pt_br: Trapaças
sv: Fusk

source: Achievements
fr: Succès
hu: Trófeák
ja: アチーブメント
pt_br: Conquistas
sv: Prestationer

source: Barcode Card
fr: Code Barre
hu: Vonalkódos kártya
ja: バーコードカード
pt_br: Cartão de código de barras
sv: Streckkodskort

source: Connect DreamLink
fr: Connecter DreamLink
hu: DreamLink kapcsolódás
ja: DreamLinkに接続
pt_br: Conectar DreamLink
sv: Anslut DreamLink

source: Disconnect DreamLink
fr: Déconnecter DreamLink
hu: DreamLink leválasztása
ja: 切断 DreamLink
pt_br: Desconectar DreamLink
sv: Koppla från DreamLink

source: Insert Disk
fr: Insérer Disque
hu: Lemez behelyezése
ja: ディスクを挿入
pt_br: Inserir Disco
sv: Mata in skiva

source: Eject Disk
fr: Éjecter Disque
hu: Lemez kiadása
ja: ディスクの取り出し
pt_br: Ejetar Disco
sv: Mata ut skiva

source: Close Game
fr: Quitter Jeu
hu: Játék bezárása
ja: ゲームを終了
pt_br: Fechar Jogo
sv: Stäng spel

source: Slot %d
fr: N° %d
ja: スロット %d
sv: Plats %d

source: Empty
fr: Vide
hu: Üres
ja: 空
pt_br: Vazio
sv: Tom

source: Incorrect Content Location?
fr: Dossier de contenu incorrect ?
ja: コンテンツの場所が間違っていませんか？
pt_br: Localização de conteúdo incorreta?
sv: Felaktig innehållsplats?

source: Scanned %d folders but no game can be found!
fr: %d dossiers parcourus mais pas de jeu trouvé !
ja: %d フォルダーをスキャンしましたが、ゲームが見つかりません！
pt_br: Foram escaneadas %d pastas, mas nenhum jogo foi encontrado!
sv: Sökte igenom %d mappar men hittade inga spel!

source: Reselect
fr: Re-sélectionner
ja: 再選択
pt_br: Selecionar novamente
sv: Välj igen

source: Cancel
fr: Annuler
hu: Mégsem
ja: キャンセル
pt_br: Cancelar
sv: Avbryt

source: GAMES
fr: JEUX
hu: JÁTÉKOK
ja: ゲーム
pt_br: JOGOS
sv: SPEL

source: Filter
fr: Filtre
hu: Szűrő
ja: フィルター
pt_br: Filtrar

source: Load...
fr: Charger...
hu: Betöltés...
ja: ロード…
pt_br: Carregar...
sv: Läs in...

source: Your game list is empty
fr: Votre librairie est vide
hu: A játéklista üres
ja: ゲームリストがありません
pt_br: Sua lista de jogos está vazia
sv: Din spellista är tom

source: Add Game Folder
fr: Ajouter des jeux
hu: Játékmappa hozzáadása
ja: ゲームフォルダーを追加
pt_br: Adicionar Pasta de Jogos
sv: Lägg till spelmapp

source: Invalid selection:
fr: Sélection invalide :
ja: 無効な選択：
pt_br: Seleção inválida:
sv: Ogiltigt val:

source: Flycast cannot write to this folder.
fr: Flycast ne peut pas écrire dans ce dossier.
hu: A Flycast nem tud ebbe a mappába írni.
ja: Flycastはこのフォルダーへの書き込みができません。
pt_br: O Flycast não pode escrever nesta pasta.
sv: Flycast kan inte skriva till denna mapp.

source: Select Flycast Home Folder
fr: Sélectionner le dossier principal de Flycast
hu: Válassza ki a Flycast Sajátmappát
ja: Flycastホームフォルダーを選択
pt_br: Selecione a pasta inicial do Flycast
sv: Välj Flycast-hemmapp

source: Starting...
fr: Démarrage...
hu: Indítás...
ja: 起動中…
pt_br: Iniciando...
sv: Startar...

source: Starting Network...
fr: Démarrage du réseau...
hu: Hálózat indítása...
ja: ネットワークを開始しています…
pt_br: Iniciando Rede...
sv: Startar nätverk...

source: Press Start to start the game now.
fr: Appuyer sur Démarrer pour démarrer le jeu maintenant.
hu: Nyomja meg a Start gombot a játék elindításához.
ja: 今すぐゲームを開始するには、スタートを押します。
pt_br: Pressione Start para iniciar o jogo agora.
sv: Tryck på Start för att starta spelet nu.

source: Loading...
fr: Chargement...
hu: Betöltés...
ja: ロード中…
pt_br: Carregando...
sv: Läser in...

source: Preloading custom textures
fr: Préchargement des textures personnalisées
ja: カスタムテクスチャーのプリロード
pt_br: Pré-carregar texturas customizadas
sv: Förinläser anpassade texturer

source: Preparing...
fr: Préparation...
hu: Előkészítés...
ja: 準備中…
pt_br: Preparando...
sv: Förbereder...

source: No screenshot available
fr: Pas de capture d'écran disponible
hu: Nincs elérhető képernyőkép
ja: スクリーンショットがありません
pt_br: Nenhuma captura de tela disponível
sv: Ingen skärmdump tillgänglig

source: Screenshot saved
fr: Capture d'écran sauvegardée
hu: Képernyőkép mentve
ja: スクリーンショットを保存しました
pt_br: Captura de tela salva
sv: Skärmbild sparades

source: Error saving screenshot
fr: Erreur de capture d'écran
ja: スクリーンショット保存中にエラー
pt_br: Erro ao salvar captura de tela
sv: Fel vid sparning av skärmbild

source: Enable DSP
fr: Activer DSP
hu: DSP engedélyezése
ja: DSPを有効にする
pt_br: Ativar DSP
sv: Aktivera DSP

source: Enable the Dreamcast Digital Sound Processor. Only recommended on fast platforms
fr: Active le processeur d'effets audio de la Dreamcast. Recommandé uniquement sur les plateformes rapides
ja: Dreamcastデジタルサウンドプロセッサーを有効にします。高速プラットフォームでのみ推奨されます
pt_br: Ative o Processador de Som Digital do Dreamcast. Recomendado apenas em plataformas rápidas
sv: Aktivera Dreamcast Digital Sound Processor. Rekommenderas endast på snabba plattformar

source: Enable VMU Sounds
fr: Active les sons VMU
ja: VMUサウンドを有効にする
pt_br: Ativar sons do VMU
sv: Aktivera VMU-ljud

source: Play VMU beeps when enabled.
fr: Reproduit les sons VMU.
ja: 有効時にVMUビープ音を鳴らします。
pt_br: Tocar bipe do VMU quando ativo.
sv: Spela VMU-pip när aktiverad.

source: Volume Level
fr: Volume sonore
hu: Hangerőszint
ja: 音量レベル
pt_br: Nível de volume
sv: Volymnivå

source: Adjust the emulator's audio level
fr: Règle le niveau de volume sonore de sortie de l'émulateur
ja: エミュレータのオーディオレベルを調整する
pt_br: Ajustar nível de áudio do emulador
sv: Justera emulatorns ljudnivå

source: Automatic Latency
fr: Latence automatique
hu: Automatikus késleltetés
ja: 自動レイテンシー
pt_br: Latência Automática
sv: Automatisk latens

source: Automatically set audio latency. Recommended
fr: Règle la latence audio automatiquement. Recommandé
ja: 自動的にオーディオレイテンシーを設定します。推奨します
pt_br: Definir automaticamente a latência do áudio. Recomendado
sv: Ställ in ljudlatens automatiskt. Rekommenderas

source: Latency
fr: Latence
hu: Késleltetés
ja: レイテンシー
pt_br: Latência
sv: Latens

source: Sets the maximum audio latency. Not supported by all audio drivers.
fr: Règle la latence audio maximum. Pas supporté par tous les pilotes.
ja: オーディオの最大レイテンシーを設定します。すべてのオーディオドライバーでサポートされているわけではありません。
pt_br: Define a latência máxima de áudio. Não suportado por todos os controladores.
sv: Ställer in maximal ljudlatens. Stöds inte av alla ljuddrivrutiner.

source: Audio Driver
fr: Pilote audio
ja: オーディオドライバー
pt_br: Controlador de Áudio
sv: Ljuddrivrutin

source: auto - Automatic driver selection
fr: auto - Sélection pilote automatique
ja: 自動 - ドライバーの自動選択
pt_br: auto - Seleção automática do controlador
sv: auto - Automatiskt val av drivrutin

source: The audio driver to use
fr: Le pilote audio à utiliser
ja: 使用するオーディオドライバー
pt_br: O Controlador de áudio a ser utilizado
sv: Ljuddrivrutin att använda

source: ADD CHEAT
fr: AJOUTER CODE
hu: CSALÁS HOZZÁADÁSA
ja: チートを追加
pt_br: ADICIONAR TRAPAÇA
sv: LÄGG TILL FUSK

source: Code
hu: Kód
ja: コード
pt_br: Código
sv: Kod

source: Select a cheat file
fr: Sélectionner un fichier de triche
hu: Válasszon ki egy csalásfájlt
ja: チートファイルを選択
pt_br: Selecione um arquivo de trapaça
sv: Välj en fuskfil

source: CHEATS
fr: CODES DE TRICHE
hu: CSALÁSOK
ja: チート
pt_br: TRAPAÇAS
sv: FUSK

source: (No cheat loaded)
fr: (Pas de code de triche chargé)
hu: (Nincs betöltött csalás)
ja: (チートがロードされていません)
pt_br: (Nenhuma trapaça carregada)
sv: (Inget fusk inläst)

source: CPU Mode
fr: Mode CPU
hu: CPU mód
ja: CPUモード
pt_br: Modo da CPU
sv: CPU-läge

source: Dynarec
ja: ダイナレック
pt_br: Recompilação Dinâmica

source: Use the dynamic recompiler. Recommended in most cases
fr: Utilise le recompilateur dynamique. Recommandé dans la plupart des cas
ja: 動的再コンパイラを使用します。ほとんどの場合推奨されます
pt_br: Use o recompilador dinâmico. Recomendado em muitos casos
sv: Använd dynamisk omkompilerare. Rekommenderas i de flesta fall

source: Interpreter
fr: Interpréteur
ja: インタープリター
pt_br: Intérprete
sv: Tolk

source: Use the interpreter. Very slow but may help in case of a dynarec problem
fr: Utilise l'interpréteur. Très lent mais peut aider en cas de problème avec le dynarec
ja: インタプリターを使用します。非常に遅いですが、ダイナレックの問題が発生した場合に役立つ可能性があります
pt_br: Use o intérprete. Muito lento, mas pode ajudar em caso de problemas na recompilação dinâmica
sv: Använd tolken. Mycket långsam men kan hjälpa i de fall dynarec har problem

source: SH4 Clock
fr: Horloge SH4
ja: SH4クロック
pt_br: Frequência do SH4
sv: SH4-klocka

source: Over/Underclock the main SH4 CPU. Default is 200 MHz. Other values may crash, freeze or trigger unexpected nuclear reactions.
fr: Augmente ou réduit la vitesse d'horloge du processeur principal SH4. Valeur normale 200 MHz. D'autres valeurs peuvent planter, figer ou déclencher des réactions nucléaires inattendues.
ja: メインのSH4 CPUをオーバークロック/アンダークロックします。デフォルトは200MHzです。これ以外の値に設定すると、クラッシュ、フリーズ、または予期せぬ核反応が発生する可能性があります。
pt_br: Ajustar overclock/underclock da CPU principal SH4. O padrão é 200 MHz. Outros valores podem causar travamentos, congelamentos ou reações nucleares inesperadas.
sv: Över/underklocka huvudprocessorn SH4. Standard är 200 MHz. Övriga värden kan krascha, frysa eller utlösa oväntade kärnreaktioner.

source: Other
fr: Autre
hu: Egyéb
ja: その他
pt_br: Outros
sv: Övriga

source: Force high-level BIOS emulation
fr: Force l'utilisation de l'émulation haut-niveau du BIOS
ja: ハイレベルのBIOS エミュレーションを強制する
pt_br: Forçar emulação de alto nível da BIOS
sv: Tvinga högnivåemulering av BIOS

source: Multi-threaded emulation
fr: Émulation en fils multiples
ja: マルチスレッドエミュレーション
pt_br: Emulação multi-threads
sv: Flertrådad emulering

source: Run the emulated CPU and GPU on different threads
fr: Exécute les processeurs principal et graphique sur des fils d'exécution distincts
ja: エミュレートされたCPUとGPUを異なるスレッドで実行
pt_br: Executar a CPU e a GPU emuladas em diferentes threads
sv: Kör emulerad CPU och GPU på olika trådar

source: Serial Console
fr: Console série
hu: Soros konzol
ja: シリアルコンソール
pt_br: Console serial
sv: Seriekonsol

source: Dump the Dreamcast serial console to stdout
fr: Affiche la sortie du port série de la console sur la sortie standard
ja: Dreamcastシリアルコンソールを標準出力にダンプ
pt_br: Despejar o serial do console Dreamcast para stdout
sv: Dumpa Dreamcasts seriekonsol till stdout

source: Enables 32MB RAM Mod for Dreamcast. May affect compatibility
fr: Active le mod 32 Mo de RAM de la Dreamcast. Peut affecter la compatibilité
ja: ドリームキャストの 32MB RAM Mod を有効にします。互換性に影響を与える可能性があります
pt_br: Ativa a modificação de 32 MB de RAM para o Dreamcast.\nOBSERVAÇÃO: pode afetar compatibilidade.
sv: Aktiverar 32MB RAM Mod för Dreamcast. Kan påverka kompatibiliteten

source: Dump Textures
fr: Sauvegarde Textures
hu: Textúrák lementése
ja: テクスチャをダンプする
pt_br: Despejar Texturas
sv: Dumpa texturer

source: Dump all textures into data/texdump/<game id>
fr: Sauvegarde toutes les textures du jeu dans 'data/texdump/<id jeu>'
ja: すべてのテクスチャーを data/texdump/<game id> にダンプします
pt_br: Despejar todas as texturas em data/texdump/<game id>
sv: Dumpa alla texturer till data/texdump/<spel-id>

source: Dump Replaced Textures
fr: Sauvegarde texture remplacée
ja: 置き換えられたテクスチャーをダンプする
pt_br: Despejar Texturas Substituídas
sv: Dumpa ersatta texturer
