Repository: flyinghead/flycast
Catalog: resources/i18n/*.po
Languages: fr, hu, ja, pt_br, sv

source: Always dump textures that are already replaced by custom textures
fr: Toujours sauvegarder les textures déjà remplacées
ja: 既にカスタムテクスチャーに置き換えられたテクスチャーを常にダンプします
pt_br: Sempre despeje texturas que já foram substituídas por texturas personalizadas
sv: Dumpa alltid texturer som redan har ersatts av anpassade texturer

source: Log to File
fr: Journal dans fichier
hu: Naplózás fájlba
ja: ファイルにログを記録
pt_br: Log para o Arquivo
sv: Logga till fil

source: Log debug information to flycast.log
fr: Sauvegarde le journal de débogage dans flycast.log
ja: flycast.logにデバッグ情報を記録する
pt_br: Registrar informações de depuração em flycast.log
sv: Logga felsökningsinformation till flycast.log

source: Automatically Report Crashes
fr: Rapport de crash automatique
ja: クラッシュを自動的に報告
pt_br: Relatar falhas automaticamente
sv: Rapportera krascher automatiskt

source: Automatically upload crash reports to sentry.io to help in troubleshooting. No personal information is included.
fr: Envoie un rapport de crash automatiquement à sentry.io. Aucune information personnelle n'est envoyée.
ja: トラブルシューティングに役立てるため、クラッシュレポートをsentry.ioに自動的にアップロードします。個人情報は含まれません。
pt_br: Enviar automaticamente relatórios de falha para sentry.io para ajudar na resolução de problemas. Nenhuma informação pessoal será incluída.
sv: Skicka automatiskt upp rapporter till sentry.io för att hjälpa vid felsökning. Ingen personlig information inkluderas.

source: Lua Scripting
fr: Script Lua
hu: Lua szkriptelés
ja: Luaスクリプト
sv: Lua-skript

source: Lua Filename
fr: Fichier Lua
hu: Lua fájlnév
ja: Luaファイル名
pt_br: Nome do Arquivo Lua
sv: Lua-filnamn

source: Specify lua filename to use. Should be located in Flycast config folder. Defaults to flycast.lua when empty.
fr: Indique le fichier Lua à utiliser. Il devrait être situé dans le dossier de configuration de Flycast. Le fichier par défaut est flycast.lua si aucun nom n'est spécifié.
hu: Adja meg a használni kívánt lua fájl nevét. A Flycast konfigurációs mappában kell lennie. Ha üres, akkor alapértelmezés szerint flycast.lua.
ja: 使用するluaファイル名を指定します。Flycastの設定フォルダに配置する必要があります。空の場合はflycast.luaがデフォルトとなります。
pt_br: Especifique o nome do arquivo a ser usado. Deve ser localizado na pasta de configuração do Flycast. O padrão é flycast.lua quando vazio.
sv: Ange lua-filnamn att använda. Bör ligga i Flycasts konfigurationsmapp. Standard är flycast.lua när den är tom.

source: General
fr: Général
hu: Általános
ja: 一般
pt_br: Geral
sv: Allmänt

source: Controls
fr: Contrôles
hu: Vezérlők
ja: コントロール
pt_br: Controles
sv: Kontroller

source: Video
fr: Vidéo
hu: Videó
ja: ビデオ
pt_br: Vídeo

source: Audio
fr: Son
hu: Hang
ja: オーディオ
pt_br: Áudio
sv: Ljud

source: Network
fr: Réseau
hu: Hálózat
ja: ネットワーク
pt_br: Rede
sv: Nätverk

source: About
fr: À propos
hu: Névjegy
ja: アプリについて
pt_br: Sobre
sv: Om

source: Storage
fr: Stockage
hu: Tárhely
ja: ストレージ
pt_br: Armazenamento
sv: Lagring

source: .. Up to Parent Folder
fr: .. Remonter au dossier parent
hu: .. Fel a szülő mappába
ja: ..親フォルダへ
pt_br: .. Até a Pasta Pai
sv: .. Upp till överliggande mapp

source: Select Current Folder
fr: Sélectionner ce dossier
hu: Aktuális mappa kiválasztása
ja: 現在のフォルダを選択
pt_br: Selecionar Pasta Atual
sv: Välj aktuell mapp

source: Reset
fr: Réinitialiser
hu: Alapállapot
ja: リセット
pt_br: Reiniciar
sv: Återställ

source: Network Type
fr: Type de Réseau
hu: Hálózattípus
ja: ネットワークタイプ
pt_br: Tipo de rede
sv: Nätverkstyp

source: Enable networking using GGPO
fr: Utilise le protocole GGPO
ja: GGPOを使用してネットワークを有効にする
pt_br: Ativar rede usando GGPO
sv: Aktivera nätverk med GGPO

source: Enable networking for supported Naomi and Atomiswave games
fr: Active le réseau pour les jeux Naomi et Atomiswave supportés
ja: サポートされているNaomiとAtomiwaveゲームのネットワークを有効にする
pt_br: Habilitar rede para jogos suportados na Naomi e Atomiswave
sv: Aktivera nätverk för Naomi och Atomiswave-spel som har stöd för det

source: Battle Cable
ja: バトルケーブル
pt_br: Cabo de Batalha

source: Emulate the Taisen (Battle) null modem cable for games that support it
fr: Émule le câble null modem (Battle Cable ou Taisen Cable) pour les jeux qui le supportent
ja: 対戦(バトル)ヌルモデムケーブルをサポートするゲームでエミュレートします
pt_br: Emule o modem Taisen (Batalha) para jogos que o suportam
sv: Emulera nollmodemkabel för Taisen (Battle) för spel som har stöd för det

source: Configuration
hu: Konfiguráció
ja: 構成
pt_br: Configuração
sv: Konfiguration

source: Play as Player 1
fr: Jouer comme Joueur 1
ja: プレイヤー1としてプレイ
pt_br: Jogue como Jogador 1
sv: Spela som spelare 1

source: Deselect to play as player 2
fr: Désélectionner pour jouer comme joueur 2
ja: プレイヤー2としてプレイするには選択を解除してください
pt_br: Desmarque para jogar como jogador 2
sv: Avmarkera för att spela som spelare 2

source: Peer
fr: Adversaire
ja: ピア
pt_br: Par
sv: Motpart

source: Your peer IP address and optional port
fr: L'adresse IP et le port (optionnel) de votre adversaire
ja: あなたのピアIPアドレスとオプションのポート
pt_br: Seu endereço IP de par e porta opcional
sv: Din IP-adress och valfri port

source: Frame Delay
fr: Délai de trames
ja: フレーム遅延
pt_br: Atraso de quadro
sv: Bildfördröjning

source: Sets Frame Delay, advisable for sessions with ping >100 ms
fr: Configure un délai de trame, recommandé pour les sessions avec un ping supérieur à 100 ms
ja: フレーム遅延を設定します。pingが100ミリ秒を超えるセッションに推奨されます
pt_br: Define o atraso do quadro, aconselhável para sessões com ping >100 ms
sv: Ställer in bildfördröjning, lämpligt för sessioner med ping >100 ms

source: Left Thumbstick:
fr: Stick gauche :
ja: 左アナログスティック：
pt_br: Analógico Esquerdo:
sv: Vänster tumspak:

source: Left thumbstick not used
fr: Stick gauche non utilisé
ja: 左のアナログスティックは使用されていません
pt_br: Analógico esquerdo não usado
sv: Vänster tumspak används inte

source: Horizontal
hu: Vízszintes
ja: 水平
sv: Horisontell

source: Use the left thumbstick horizontal axis only
fr: Stick gauche utilisé sur l'axe horizontal seulement
ja: 左スティックの水平軸のみを使用する
pt_br: Usar apenas o eixo horizontal do analógico esquerdo
sv: Använd endast den horisontella axeln på vänstra tumspaken

source: Full
fr: Complet
hu: Teljes
ja: フル
pt_br: Completo
sv: Fullständig

source: Use the left thumbstick horizontal and vertical axes
fr: Stick gauche utilisé sur les axes vertical et horizontal
ja: 左スティックの水平軸と垂直軸を使用する
pt_br: Usar os eixos horizontais e verticais do analógico esquerdo
sv: Använd vertikala och horisontella axlar på vänstra tumspaken

source: Enable Chat
fr: Activer le Chat
hu: Csevegés engedélyezése
ja: チャットを有効にする
pt_br: Habilitar bate-papo
sv: Aktivera chatt

source: Open the chat window when a chat message is received
fr: Ouvre la fenêtre de discussion quand un message est reçu
ja: チャットメッセージを受信したときにチャットウィンドウを開く
pt_br: Abrir a janela de bate-papo quando uma mensagem é recebida
sv: Öppna chattfönstret när ett chattmeddelande tas emot

source: Enable Chat Window Timeout
fr: Désactivation Chat Automatique
ja: チャットウィンドウのタイムアウトを有効にする
pt_br: Habilitar tempo limite da janela de bate-papo
sv: Aktivera tidsgräns för chattfönster

source: Automatically close chat window after 20 seconds
fr: Ferme la fenêtre de discussion automatiquement après 20 secondes
ja: 20秒後にチャットウィンドウを自動的に閉じます
pt_br: Fechar janela de bate-papo automaticamente após 20 segundos
sv: Stäng chattfönstret automatiskt efter 20 sekunder

source: Chat Window Timeout (seconds)
fr: Délai de fermeture (secondes)
ja: チャットウィンドウのタイムアウト(秒)
pt_br: Tempo limite da janela de bate-papo (segundos)
sv: Tidsgräns för chattfönster (sekunder)

source: Sets duration that chat window stays open after new message is received.
fr: Le délai entre la réception d'un message et la fermeture de la fenêtre de discussion.
ja: 新しいメッセージを受信した後にチャットウィンドウを開いたままにする期間を設定します。
pt_br: Define a duração que a janela de bate-papo permanece aberta depois que uma nova mensagem for recebida.
sv: Ställer in längden som chattfönstret är öppet efter nytt meddelande tagits emot.

source: Network Statistics
fr: Statistiques Réseau
hu: Hálózati statisztika
ja: ネットワーク統計
pt_br: Estatísticas da Rede
sv: Nätverksstatistik

source: Display network statistics on screen
fr: Affiche des statistiques réseau en temps réel
ja: ネットワーク統計を画面に表示する
pt_br: Mostrar estatísticas da rede na tela
sv: Visa nätverksstatistik på skärmen

source: Act as Server
fr: Rôle Serveur
ja: サーバーとして実行
pt_br: Agir como Servidor
sv: Agera som server

source: Create a local server for Naomi network games
fr: Créer un serveur local pour les jeux réseau Naomi
ja: Naomiネットワークゲーム用のローカルサーバーを作成する
pt_br: Crie um servidor local para jogos de rede Naomi
sv: Skapa en lokal server för Naomi nätverksspel

source: Server
fr: Serveur
hu: Szerver
ja: サーバー
pt_br: Servidor

source: The server to connect to. Leave blank to find a server automatically on the default port
fr: Le serveur à contacter. Laisser vide pour trouver un serveur automatiquement sur le port par défaut
ja: 接続先のサーバー。空白のままにすると自動的にデフォルトのポートでサーバーを検索します
pt_br: O servidor para se conectar. Deixe em branco para encontrar um servidor automaticamente na porta padrão
sv: Servern att ansluta till. Lämna tomt för att hitta en server automatiskt på standardporten

source: Local Port
fr: Port Local
hu: Helyi port
ja: ローカルポート
pt_br: Porta Local
sv: Lokal port

source: The local UDP port to use
fr: Le port UDP local à utiliser
ja: 使用するローカルUDPポート
pt_br: A porta UDP local a ser usada
sv: Den lokala UDP-porten att använda

source: Match Code
fr: Code de Match
ja: マッチコード
pt_br: Código da partida
sv: Matcha kod

source: Choose a unique word or number and share it with your opponent.
fr: Choisissez un mot ou nombre unique et communiquez-le à votre adversaire.
ja: ユニークな単語または番号を選択し、相手と共有します。
pt_br: Escolha uma palavra ou número único e compartilhe-a com seu oponente.
sv: Välj ett unikt ord eller nummer och dela det med din motståndare.

source: Connect
fr: Connecter
hu: Csatlakozás
ja: 接続
pt_br: Conectar
sv: Anslut

source: Disconnect
fr: Déconnecter
hu: Kapcsolat bontása
ja: 切断
pt_br: Desconectar
sv: Koppla från

source: Waiting at meeting point...
fr: En attente au point de rendez-vous...
ja: ミーティングポイントで待機中…
pt_br: Aguardando no ponto de encontro…
sv: Väntar vid mötespunkten...

source: Preparing game...
fr: Préparation du jeu...
ja: ゲームを準備中…
pt_br: Preparando o jogo...
sv: Förbereder spel...

source: Playing %s (%s)
fr: Jeu %s (%s)
ja: プレイ中 %s (%s)
pt_br: Jogando %s (%s)
sv: Spelar %s (%s)

source: The peer to connect to. Leave blank to find a player automatically on the default port
fr: L'adresse de l'adversaire. Laisser vide pour trouver un joueur automatiquement sur le port par défaut
ja: 接続先のピア。空白にすると、デフォルトのポートで自動的にプレイヤーが検索されます
pt_br: O par para se conectar. Deixe em branco para encontrar um jogador automaticamente na porta padrão
sv: Motparten att ansluta till. Lämna tom för att hitta en spelare automatiskt på standardporten

source: Act as Master
fr: Rôle Maître
ja: マスターとして実行
pt_br: Agir como Mestre
sv: Agera som Master

source: Only used for Maximum Speed. One of the peer must be master.
fr: Uniquement pour Maximum Speed. Un des deux joueurs doit avoir ce rôle.
ja: 最大速度にのみ使用されます。ピアのひとつがマスターである必要があります。
pt_br: Usado apenas para o jogo "Maximum Speed". Um dos pares deve ser o mestre.
sv: Används endast för Maximum Speed. En av motparterna måste vara master.

source: Network Options
fr: Options Réseau
hu: Hálózati beállítások
ja: ネットワークオプション
pt_br: Opções de Rede
sv: Nätverksalternativ

source: Enable UPnP
fr: Activer UPnP
hu: UPnP engedélyezése
ja: UPnPを有効にする
pt_br: Ativar UPnP
sv: Aktivera UPnP

source: Automatically configure your network router for netplay
fr: Configure automatiquement votre routeur pour les jeux en réseau
ja: ネットプレイ用にネットワークルーターを自動的に構成する
pt_br: Configurar automaticamente o roteador de rede para netplay
sv: Konfigurera din nätverksrouter automatiskt för netplay

source: Broadcast Digital Outputs
fr: Diffusion des Sorties Digitales
ja: ブロードキャストデジタル出力
pt_br: Transmitir Saídas Digitais
sv: Sänd ut digitala utgångar

source: Broadcast digital outputs and force-feedback state on TCP port 8000. Compatible with the "-output network" MAME option. Arcade games only.
fr: Transmet les sorties digitales et le retour de force sur le port TCP 8000. Compatible avec l'option "-output network" de MAME. Jeux d'arcade uniquement.
ja: TCPポート8000でデジタル出力とフォースフィードバックの状態をブロードキャストします。MAMEオプションの -output network と互換性があります。アーケードゲームのみ。
pt_br: Transmita saídas digitais e estado de feedback forçado na porta TCP 8000. Compatível com a opção "rede de saída" opção do MAME. Jogos Arcade apenas.
sv: Sänder digitala utgångar och force feedback-tillstånd på TCP-port 8000. Kompatibel med MAME-alternativet ”-output network”. Endast arkadspel.

source: Broadband Adapter Emulation
fr: Émulation de l'adaptateur réseau haut-débit
ja: ブロードバンドアダプターエミュレーション
pt_br: Emulação do adaptador de banda larga
sv: Emulering av Broadband Adapter

source: Emulate the Ethernet Broadband Adapter (BBA) instead of the Modem
fr: Émule la carte Ethernet (BBA) au lieu du modem
ja: モデムの代わりにイーサネットブロードバンドアダプター(BBA)をエミュレートします
pt_br: Emular o adaptador de banda larga Ethernet (BBA) em vez do Modem
sv: Emulera Ethernet Broadband Adapter (BBA) istället för modemet

source: Use DCNet
fr: Utiliser DCNet
hu: DCNet használata
ja: DCNetを使用する
pt_br: Usar DCNet
sv: Använd DCNet

source: Use the DCNet cloud service for Dreamcast Internet access.
fr: Utiliser le VPN DCNet pour l'accès à Internet Dreamcast.
ja: DreamcastインターネットへのアクセスにはDCNetクラウドサービスを使用します。
pt_br: Use o serviço de nuvem DCNet para o acesso à Internet Dreamcast.
sv: Använd molntjänsten DCNet för internetåtkomst för Dreamcast.

source: ISP User Name
fr: Nom d'utilisateur FAI
ja: ISPユーザー名
pt_br: Nome de Usuário do Provedor
sv: ISP-användarnamn

source: The ISP user name stored in the console Flash RAM. Used by some online games as the player name. Leave blank to keep the current Flash RAM value.
fr: Le nom d'utilisateur FAI stocké dans la mémoire flash de la console. Utilisé comme nom de joueur par certains jeux en ligne. Laisser vide pour garder le nom stocké en mémoire flash.
ja: コンソールのフラッシュRAMに格納されているISPユーザー名。 一部のオンラインゲームでプレイヤー名として使用されます。現在のフラッシュRAMの値を維持するには空白のままにしてください。
pt_br: O nome de usuário do provedor armazenado na memória Flash do console. É usado por alguns jogos online como o nome do jogador. Deixe em branco para manter o valor atual da memória Flash.
sv: ISP-användarnamn som lagras i konsolens Flash RAM-minne. Används av vissa nätspel som spelarens namn. Lämna tomt för att behålla det aktuella Flash RAM-värdet.

source: Multiboard Screens
fr: Écrans Multi-cartes
ja: マルチボードスクリーン
pt_br: Telas Múltiplas
sv: Multiboard-skärmar

source: 1 (Twin)
ja: 1 (ツイン)
pt_br: 1(Dupla)

source: One screen configuration (F355 Twin)
fr: Borne avec écran unique (F355 Twin)
ja: 1画面構成 (F355ツイン)
pt_br: Configuração de uma tela (F355 Dupla)
sv: Konfiguration för en skärm (F355 Twin)

source: 3 (Deluxe)
ja: 3 (デラックス)
pt_br: 3 (De luxo)

source: Three screens configuration
fr: Borne de luxe avec trois écrans
ja: 3画面構成
pt_br: Configuração de três telas
sv: Konfiguration med tre skärmar

source: Version: %s
hu: Verzió: %s
ja: バージョン: %s
pt_br: Versão: %s

source: Git Hash: %s
fr: Hash Git : %s
ja: Gitハッシュ: %s
pt_br: Hash do Gil

source: Build Date: %s
fr: Date de build : %s
hu: Build dátuma: %s
ja: ビルド日時: %s
pt_br: Data da Compilação: %s
sv: Byggdatum: %s

source: Platform
fr: Plateforme
ja: プラットフォーム
pt_br: Plataforma
sv: Plattform

source: Unknown
fr: Inconnu
hu: Ismeretlen
ja: 不明
pt_br: Desconhecido
sv: Okänt

source: Operating System: %s
fr: Système d'exploitation : %s
hu: Operációs rendszer: %s
ja: OS: %s
pt_br: Sistema Operacional: %s
sv: Operativsystem: %s

source: Windows Universal Platform
fr: Plateforme Windows universelle
ja: UWP
pt_br: Plataforma Universal do Windows

source: JIT Status: %s
fr: Statut JIT : %s
hu: JIT állapot: %s
ja: JITステータス: %s
pt_br: Estatuto do JIT: %s

source: Driver Name: %s
fr: Nom du pilote : %s
ja: ドライバ名: %s
pt_br: Nome do controlador: %s
sv: Drivrutinsnamn: %s

source: Select a custom GPU driver
fr: Sélectionner un pilote graphique personnalisé
ja: カスタムGPUドライバを選択
pt_br: Selecionar um controlador personalizado para GPU
sv: Välj en anpassad GPU-drivrutin

source: Custom Driver:
fr: Pilote personnalisé :
ja: カスタムドライバー：
pt_br: Controlador Personalizado:
sv: Anpassad drivrutin:

source: Use Default Driver
fr: Utiliser pilote standard
ja: デフォルトのドライバーを使用
pt_br: Usar Controlador Padrão
sv: Använd standarddrivrutin

source: Reset Vulkan
fr: Réinitialiser Vulkan
hu: Vulkán alaphelyzetbe
ja: Vulkanをリセットする
pt_br: Reiniciar Vulkan
sv: Återställ Vulkan

source: Upload Custom Driver
fr: Ajouter un pilote personnalisé
ja: カスタムドライバーをアップロード
pt_br: Carregar Controlador Personalizado
sv: Skicka upp anpassad drivrutin

source: Do you want to reset Vulkan to use new driver?
fr: Voulez-vous réinitialiser Vulkan pour utiliser le nouveau pilote ?
ja: Vulkanをリセットして新しいドライバを使用しますか？
pt_br: Deseja reiniciar o Vulkan para usar um novo controlador?
sv: Vill du återställa Vulkan för att använda ny drivrutin?

source: Save state failed - memory full
fr: Échec de sauvegarde - mémoire pleine
ja: ステートの保存に失敗しました - メモリがいっぱいです
pt_br: Falha ao salvar estado - memória cheia
sv: Sparat tillstånd misslyckades - minnet är fullt

source: Cannot open save file
fr: Impossible d'ouvrir le fichier de sauvegarde
hu: Nem lehet megnyitni a mentett fájlt
ja: セーブファイルを開けません
pt_br: Impossível abrir o arquivo de salvamento
sv: Kan inte öppna sparad fil

source: State saved
fr: État sauvegardé
hu: Az állapot mentve
ja: ステートを保存しました
pt_br: Estado salvo
sv: Tillstånd sparat

source: Error saving state
fr: Échec de sauvegarde
hu: Hiba állapotmentés közben
ja: ステートの保存に失敗しました
pt_br: Erro ao salvar estado
sv: Fel vid sparning av tillstånd

source: Save state not found
fr: État introuvable
hu: Állapotmentés nem található
ja: セーブステートが見つかりません
pt_br: Estado salvo não encontrado
sv: Sparat tillstånd hittades inte

source: Failed to load state
fr: Échec de chargement
ja: ステートの読み込みに失敗しました
pt_br: Falha no carregamento do estado
sv: Misslyckades med att läsa in tillstånd

source: Not enough memory
fr: Pas assez de mémoire
hu: Nincs elég memória
ja: メモリが足りません
pt_br: Memória insuficiente
sv: Inte tillräckligt med minne

source: I/O error
fr: Erreur d'entrée/sortie
hu: I/O hiba
ja: I/Oエラー
pt_br: Erro de entrada ou saída
sv: I/O-fel

source: Connected to DCNet with modem
fr: Connecté à DCNet avec le modem
ja: モデムでDCNetに接続しました
pt_br: Conectado à DCNet com o modem
sv: Ansluten till DCNet med modem

source: Connected to DCNet with Ethernet
fr: Connecté à DCNet avec Ethernet
ja: イーサネットでDCNetに接続しました
pt_br: Conectado à DCNet com Ethernet
sv: Ansluten till DCNet med ethernet

source: DCNet disconnected
fr: DCNet déconnecté
ja: DCNetが切断されました
pt_br: DCNet desconectada
sv: DCNet frånkopplat

source: Host not found
fr: Nom de serveur inconnu
ja: ホストが見つかりません
pt_br: Servidor não encontrado
sv: Värden hittades inte

source: Can't connect to DCNet
fr: Connexion à DCNet impossible
ja: DCNetに接続できません
pt_br: Não é possível conectar-se a DCNet
sv: Kan inte ansluta till DCNet

source: Connected to peer
fr: Connecté à l'adversaire
ja: ピアに接続しました
pt_br: Conectado ao par
sv: Ansluten till motpart

source: Synchronizing with peer
fr: Synchronisation avec l'adversaire
ja: ピアと同期中
pt_br: Sincronizando com o par
sv: Synkroniserar med motpart

source: Synchronized with peer
fr: Synchronisé avec l'adversaire
ja: ピアと同期しました
pt_br: Sincronizado com o par
sv: Synkroniserad med motpart

source: Running
fr: En fonctionnement
hu: Fut
ja: 実行中
pt_br: Executando
sv: Kör

source: Disconnected from peer
fr: Déconnecté de l'adversaire
ja: ピアから切断されました
pt_br: Desconectado do par
sv: Kopplade från motpart

source: Connection interrupted
fr: Connexion interrompue
ja: 接続が中断されました
pt_br: Conexão interrompida
sv: Anslutningen avbröts

source: Connection resumed
fr: Connexion rétablie
ja: 接続を再開しました
pt_br: Conexão retomada
sv: Anslutningen återupptogs

source: Network connected
fr: Réseau connecté
hu: Hálózat csatlakoztatva
ja: ネットワークに接続しました
pt_br: Rede conectada
sv: Nätverk anslutet

source: Game not supported
fr: Jeu non supporté
hu: A játék nem támogatott
ja: ゲームはサポートされてません
pt_br: Jogo não suportado
sv: Spelet stöds inte

source: Connection to lobby failed:
fr: Échec de connexion au lobby :
ja: ロビーへの接続に失敗しました：
pt_br: Falha na conexão com a sala:
sv: Anslutning till lobby misslyckades:

source: Connection failed
fr: Échec de connexion
hu: Csatlakozás sikertelen
ja: 接続に失敗しました
pt_br: Conexão falhou
sv: Anslutning misslyckades

source: Direct peer to peer
fr: Direct pair-à-pair
ja: ダイレクトP2P
pt_br: Direcionar ponto a ponto
sv: Direkt motpart till motpart

source: Using relay
fr: Relai utilisé
ja: リレーの使用
pt_br: Usando retransmissão
sv: Använder relä

source: Connection lost
fr: Connexion perdue
ja: 接続が失われました
pt_br: Conexão perdida
sv: Anslutning förlorad

source: Waiting for players...
fr: En attente des joueurs...
hu: Várakozás a játékosokra...
ja: プレイヤーを待っています…
pt_br: Esperando por jogadores...
sv: Väntar på spelare...

source: %d player connected. Waiting...
fr: %d joueur connecté. En attente...
hu: %d játékos csatlakozott. Várakozás...
ja: %d 人のプレイヤーが接続しました。おまちください…
pt_br: %d jogador conectado. Aguardando...
sv: %d spelare ansluten. Väntar...

source: Starting game
fr: Démarrage du jeu
hu: Játék elinditása
ja: ゲームを開始
pt_br: Iniciando jogo
sv: Startar spelet

source: No player connected
fr: Aucun joueur connecté
hu: Nincs csatlakozott játékos
ja: プレイヤーが接続されていません
pt_br: Nenhum jogador conectado
sv: Ingen spelare ansluten

source: Connecting to server
fr: Connexion au serveur
hu: Csatlakozás a szerverhez
ja: サーバに接続中
pt_br: Conectando ao servidor
sv: Ansluter till server

source: Connected as slot %d
fr: Connecté comme nœud %d
ja: スロット %dとして接続しました
pt_br: Conectado como slot %d
sv: Ansluten som plats %d

source: DirectX 9 doesn't support Naomi 2 games. Select a different graphics API
fr: DirectX 9 ne supporte les jeux Naomi 2. Sélectionnez une API graphique différente
ja: DirectX 9はNaomi 2ゲームをサポートしていません。別のグラフィックスAPIを選択してください
pt_br: DirectX 9 não suporta jogos Naomi 2. Selecione uma API gráfica diferente
sv: DirectX 9 saknar stöd för Naomi 2-spel. Välj ett annat grafik-API

source: Can't open zip file
fr: Impossible d'ouvrir le fichier Zip
hu: Nem lehet megnyitni a zip fájlt
ja: zipファイルを開けません
pt_br: Não foi possível abrir o arquivo zip
sv: Kan inte öppna zip-fil

source: Invalid zip file
fr: Fichier Zip invalide
hu: Hibás zip fájl
ja: 無効なzipファイル
pt_br: Arquivo zip inválido
sv: Ogiltig zip-fil

source: Can't save files
fr: Impossible de sauvegarder les fichiers
hu: Nem lehet menteni a fájlokat
ja: ファイルを保存できません
pt_br: Não foi possível salvar arquivos
sv: Kan inte spara filer

source: Can't read zip
fr: Impossible de lire le fichier Zip
hu: Nem lehet olvasni a zip fájlt
ja: zipを読み込めません
pt_br: Não foi possível ler zip
sv: Kan inte läsa zip

source: OpenGL ES 3.0+ required for Naomi 2
fr: OpenGL ES 3.0+ est requis pour les jeux Naomi 2
ja: Naomi2にはOpenGL ES 3.0+ が必要です
pt_br: OpenGL ES 3.0+ necessário para Naomi 2
sv: OpenGL ES 3.0+ krävs för Naomi 2

source: No BIOS file found in %s
fr: Pas de fichier BIOS trouvé dans %s
ja: %s にBIOSファイルが見つかりません
pt_br: Nenhum arquivo BIOS encontrado no %s
sv: Ingen BIOS-fil hittades i %s

source: This game requires a real BIOS
fr: Ce jeu demande un BIOS authentique
hu: Ehhez a játékhoz valódi BIOS szükséges
ja: このゲームには実際のBIOSが必要です
pt_br: Este jogo requer uma Bios verdadeira
sv: Detta spel kräver ett riktigt BIOS

source: Widescreen cheat activated
fr: Code de triche écran large activé
hu: Széles képernyős csalás aktiválva
ja: ワイドスクリーンチートが有効になりました
pt_br: Trapaça de Tela Cheia ativada
sv: Bredskärmsfusk aktiverat

source: Virtual Gamepad
ja: 仮想ゲームパッド
pt_br: Controle Virtual
sv: Virtuell gamepad

source: Left Button
hu: Bal gomb
ja: 左ボタン
pt_br: Botão esquerdo
sv: Vänsterknapp

source: Right Button
hu: Jobb gomb
ja: 右ボタン
pt_br: Botão direito
sv: Högerknapp
